{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Introduction:\n",
    "### Neo4J:\n",
    "   <a href=\"https://neo4j.com/\">Neo4J</a>  is a graph database management system developed by Neo4j, Inc. Described by its developers as a native graph storage and processing. It is the most popular graph database according to DB-Engines ranking, and the 22nd most popular database overall.<br/>\n",
    "<img src=\"https://neo4j.com/wp-content/themes/neo4jweb/assets/images/neo4j-logo-2015.png\">\n",
    "\n",
    "\n",
    "### The Property Graph Model\n",
    "* In the property graph model, data is organized as nodes, relationships, and properties (data stored on the nodes or relationships).\n",
    "\n",
    "<img src= 'https://dist.neo4j.com/wp-content/uploads/property_graph_elements.jpg' width='600'>\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "###  Cypher Query Language\n",
    "\n",
    "Cypher is Neo4j’s graph query language that allows users to store and retrieve data from the graph database. Cypher’s syntax provides a visual and logical way to match patterns of nodes and relationships in the graph.\n",
    "t is a declarative, SQL-inspired language for describing visual patterns in graphs using ASCII-Art syntax. It allows us to state what we want to select, insert, update, or delete from our graph data without a description of exactly how to do it.\n",
    "\n",
    "- First Steps with Cypher can be followed from this <a href='https://neo4j.com/developer/cypher/'>link </a>.\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Pre-Lab:\n",
    "### Installation\n",
    "\n",
    "1. Install neo4j 3.5 Community Edition followin this <a href='https://neo4j.com/download-thanks/?edition=community&release=3.5.21&flavour=winzip&_ga=2.186751336.1137015944.1598288824-1813280835.1541597058'>link </a>\n",
    "\n",
    "\n",
    "Note:\n",
    "\n",
    " * Click  <a href= 'https://neo4j.com/download-thanks-desktop/?edition=desktop&flavour=winstall64&release=1.3.4&offline=true'> here </a> to download the latest version of neo4j DeskTop for Windows.\n",
    " * Follow the installation guide provided <a href= 'https://neo4j.com/download-thanks-desktop/?edition=desktop&flavour=winstall64&release=1.3.4&offline=true#installation-guide' > here </a> to download, install neo4j DEsktop on your Windows.\n",
    " * make sure that you run Neo4j as a console application, use: \n",
    "     - <b> NEO4J_HOME\\bin\\neo4j console </b>\n",
    "     - Or install Neo4j as a service using: <b>NEO4J_HOME\\bin\\neo4j install-service </b>\n",
    " "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "2. We can use the <b> \"Neo4j Python\" </b> driver which is officially supported by Neo4j and connects to the database using the binary protocol.\n",
    "It aims to be minimal, while being idiomatic to Python. <a href=\"https://neo4j.com/developer/python/\">here</a>:\n",
    "```\n",
    "pip install neo4j\n",
    "``` "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### ipython-cypher\n",
    "[ipython-cypher](https://github.com/versae/ipython-cypher) is another way to connect to a graph database in python. it uses <b> neo4jrestclient_ driver </b>, then issue Cypher commands within IPython or IPython Notebook.\n",
    "#### ipython-cypher install"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Requirement already satisfied: ipython-cypher in /opt/conda/lib/python3.9/site-packages (0.2.6)\n",
      "Requirement already satisfied: ipython>=1.0 in /opt/conda/lib/python3.9/site-packages (from ipython-cypher) (7.23.1)\n",
      "Requirement already satisfied: prettytable in /opt/conda/lib/python3.9/site-packages (from ipython-cypher) (0.7.2)\n",
      "Requirement already satisfied: neo4jrestclient>=2.1.0 in /opt/conda/lib/python3.9/site-packages (from ipython-cypher) (2.1.1)\n",
      "Requirement already satisfied: pygments in /opt/conda/lib/python3.9/site-packages (from ipython>=1.0->ipython-cypher) (2.9.0)\n",
      "Requirement already satisfied: pickleshare in /opt/conda/lib/python3.9/site-packages (from ipython>=1.0->ipython-cypher) (0.7.5)\n",
      "Requirement already satisfied: decorator in /opt/conda/lib/python3.9/site-packages (from ipython>=1.0->ipython-cypher) (5.0.9)\n",
      "Requirement already satisfied: setuptools>=18.5 in /opt/conda/lib/python3.9/site-packages (from ipython>=1.0->ipython-cypher) (49.6.0.post20210108)\n",
      "Requirement already satisfied: backcall in /opt/conda/lib/python3.9/site-packages (from ipython>=1.0->ipython-cypher) (0.2.0)\n",
      "Requirement already satisfied: traitlets>=4.2 in /opt/conda/lib/python3.9/site-packages (from ipython>=1.0->ipython-cypher) (5.0.5)\n",
      "Requirement already satisfied: matplotlib-inline in /opt/conda/lib/python3.9/site-packages (from ipython>=1.0->ipython-cypher) (0.1.2)\n",
      "Requirement already satisfied: jedi>=0.16 in /opt/conda/lib/python3.9/site-packages (from ipython>=1.0->ipython-cypher) (0.18.0)\n",
      "Requirement already satisfied: pexpect>4.3 in /opt/conda/lib/python3.9/site-packages (from ipython>=1.0->ipython-cypher) (4.8.0)\n",
      "Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in /opt/conda/lib/python3.9/site-packages (from ipython>=1.0->ipython-cypher) (3.0.18)\n",
      "Requirement already satisfied: parso<0.9.0,>=0.8.0 in /opt/conda/lib/python3.9/site-packages (from jedi>=0.16->ipython>=1.0->ipython-cypher) (0.8.2)\n",
      "Requirement already satisfied: requests>=2.1.0 in /opt/conda/lib/python3.9/site-packages (from neo4jrestclient>=2.1.0->ipython-cypher) (2.25.1)\n",
      "Requirement already satisfied: ptyprocess>=0.5 in /opt/conda/lib/python3.9/site-packages (from pexpect>4.3->ipython>=1.0->ipython-cypher) (0.7.0)\n",
      "Requirement already satisfied: wcwidth in /opt/conda/lib/python3.9/site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-cypher) (0.2.5)\n",
      "Requirement already satisfied: chardet<5,>=3.0.2 in /opt/conda/lib/python3.9/site-packages (from requests>=2.1.0->neo4jrestclient>=2.1.0->ipython-cypher) (4.0.0)\n",
      "Requirement already satisfied: certifi>=2017.4.17 in /opt/conda/lib/python3.9/site-packages (from requests>=2.1.0->neo4jrestclient>=2.1.0->ipython-cypher) (2020.12.5)\n",
      "Requirement already satisfied: urllib3<1.27,>=1.21.1 in /opt/conda/lib/python3.9/site-packages (from requests>=2.1.0->neo4jrestclient>=2.1.0->ipython-cypher) (1.26.4)\n",
      "Requirement already satisfied: idna<3,>=2.5 in /opt/conda/lib/python3.9/site-packages (from requests>=2.1.0->neo4jrestclient>=2.1.0->ipython-cypher) (2.10)\n",
      "Requirement already satisfied: ipython-genutils in /opt/conda/lib/python3.9/site-packages (from traitlets>=4.2->ipython>=1.0->ipython-cypher) (0.2.0)\n"
     ]
    }
   ],
   "source": [
    "! pip install ipython-cypher"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Inside IPython, load the extension:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "%load_ext cypher"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### And then you are reay to go by using the <b>%cypher</b> or <b>%%cypher</b> line magic:\n",
    "\n",
    "you have to write down the connection url http://username:password@127.0.0.1:7474/db/data after the %%cypher to access your active DB using the neo4j http port (7474)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "- '''%cypher''' is intended for one-line Cypher queries and '''%%cypher''' is intended for multi-line Cypher queries. \n",
    "- Placing \"%%cypher\" above a Cypher query will display that query's results."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Task 1: Movie-graph DB\n",
    "The Movie Graph is a mini graph application containing actors and directors that are related through the movies they've collaborated on.\n",
    "\n",
    "- The \"Movies graph DB\" example, is launched via the <font color='red'>:play movie-graph</font> command in your neo4j web UI/browser and contains a small graph of movies and people related to those movies as actors, directors, producers etc.\n",
    "\n",
    "<img src='https://storage.googleapis.com/kaggle-datasets-images/1365/2460/229bfb5d3dd1a49cc5ac899c45ca2213/dataset-original.png' width=\"400\" height=\"100\">"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Perform some queries on the Graph database using Cypher Query Language.\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Simplified Schema with labels of DB:\n",
    "- Run this command in your broswer **Call db.schema()** "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<img src=\"schema1.png\" alt=\"3\" border=\"0\"  width=\"400\" height=\"100\">"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Get all people nodes in the Graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Format: (http|https)://username:password@hostname:port/db/name\n"
     ]
    },
    {
     "ename": "ConnectionError",
     "evalue": "HTTPConnectionPool(host='127.0.0.1', port=7474): Max retries exceeded with url: /db/data/ (Caused by NewConnectionError('<urllib3.connection.HTTPConnection object at 0x7fd0f5c03b50>: Failed to establish a new connection: [Errno 111] Connection refused'))",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mConnectionRefusedError\u001b[0m                    Traceback (most recent call last)",
      "\u001b[0;32m/opt/conda/lib/python3.9/site-packages/urllib3/connection.py\u001b[0m in \u001b[0;36m_new_conn\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    168\u001b[0m         \u001b[0;32mtry\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 169\u001b[0;31m             conn = connection.create_connection(\n\u001b[0m\u001b[1;32m    170\u001b[0m                 \u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_dns_host\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mport\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mtimeout\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m**\u001b[0m\u001b[0mextra_kw\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/opt/conda/lib/python3.9/site-packages/urllib3/util/connection.py\u001b[0m in \u001b[0;36mcreate_connection\u001b[0;34m(address, timeout, source_address, socket_options)\u001b[0m\n\u001b[1;32m     95\u001b[0m     \u001b[0;32mif\u001b[0m \u001b[0merr\u001b[0m \u001b[0;32mis\u001b[0m \u001b[0;32mnot\u001b[0m \u001b[0;32mNone\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m---> 96\u001b[0;31m         \u001b[0;32mraise\u001b[0m \u001b[0merr\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m     97\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/opt/conda/lib/python3.9/site-packages/urllib3/util/connection.py\u001b[0m in \u001b[0;36mcreate_connection\u001b[0;34m(address, timeout, source_address, socket_options)\u001b[0m\n\u001b[1;32m     85\u001b[0m                 \u001b[0msock\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mbind\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0msource_address\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m---> 86\u001b[0;31m             \u001b[0msock\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mconnect\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0msa\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m     87\u001b[0m             \u001b[0;32mreturn\u001b[0m \u001b[0msock\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;31mConnectionRefusedError\u001b[0m: [Errno 111] Connection refused",
      "\nDuring handling of the above exception, another exception occurred:\n",
      "\u001b[0;31mNewConnectionError\u001b[0m                        Traceback (most recent call last)",
      "\u001b[0;32m/opt/conda/lib/python3.9/site-packages/urllib3/connectionpool.py\u001b[0m in \u001b[0;36murlopen\u001b[0;34m(self, method, url, body, headers, retries, redirect, assert_same_host, timeout, pool_timeout, release_conn, chunked, body_pos, **response_kw)\u001b[0m\n\u001b[1;32m    698\u001b[0m             \u001b[0;31m# Make the request on the httplib connection object.\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 699\u001b[0;31m             httplib_response = self._make_request(\n\u001b[0m\u001b[1;32m    700\u001b[0m                 \u001b[0mconn\u001b[0m\u001b[0;34m,\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/opt/conda/lib/python3.9/site-packages/urllib3/connectionpool.py\u001b[0m in \u001b[0;36m_make_request\u001b[0;34m(self, conn, method, url, timeout, chunked, **httplib_request_kw)\u001b[0m\n\u001b[1;32m    393\u001b[0m             \u001b[0;32melse\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 394\u001b[0;31m                 \u001b[0mconn\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mrequest\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mmethod\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0murl\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m**\u001b[0m\u001b[0mhttplib_request_kw\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    395\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/opt/conda/lib/python3.9/site-packages/urllib3/connection.py\u001b[0m in \u001b[0;36mrequest\u001b[0;34m(self, method, url, body, headers)\u001b[0m\n\u001b[1;32m    233\u001b[0m             \u001b[0mheaders\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;34m\"User-Agent\"\u001b[0m\u001b[0;34m]\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0m_get_default_user_agent\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 234\u001b[0;31m         \u001b[0msuper\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mHTTPConnection\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mrequest\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mmethod\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0murl\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mbody\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mbody\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mheaders\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mheaders\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    235\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/opt/conda/lib/python3.9/http/client.py\u001b[0m in \u001b[0;36mrequest\u001b[0;34m(self, method, url, body, headers, encode_chunked)\u001b[0m\n\u001b[1;32m   1254\u001b[0m         \u001b[0;34m\"\"\"Send a complete request to the server.\"\"\"\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m-> 1255\u001b[0;31m         \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_send_request\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mmethod\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0murl\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mbody\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mheaders\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mencode_chunked\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m   1256\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/opt/conda/lib/python3.9/http/client.py\u001b[0m in \u001b[0;36m_send_request\u001b[0;34m(self, method, url, body, headers, encode_chunked)\u001b[0m\n\u001b[1;32m   1300\u001b[0m             \u001b[0mbody\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0m_encode\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mbody\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m'body'\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m-> 1301\u001b[0;31m         \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mendheaders\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mbody\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mencode_chunked\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mencode_chunked\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m   1302\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/opt/conda/lib/python3.9/http/client.py\u001b[0m in \u001b[0;36mendheaders\u001b[0;34m(self, message_body, encode_chunked)\u001b[0m\n\u001b[1;32m   1249\u001b[0m             \u001b[0;32mraise\u001b[0m \u001b[0mCannotSendHeader\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m-> 1250\u001b[0;31m         \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_send_output\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mmessage_body\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mencode_chunked\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mencode_chunked\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m   1251\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/opt/conda/lib/python3.9/http/client.py\u001b[0m in \u001b[0;36m_send_output\u001b[0;34m(self, message_body, encode_chunked)\u001b[0m\n\u001b[1;32m   1009\u001b[0m         \u001b[0;32mdel\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_buffer\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m-> 1010\u001b[0;31m         \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0msend\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mmsg\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m   1011\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/opt/conda/lib/python3.9/http/client.py\u001b[0m in \u001b[0;36msend\u001b[0;34m(self, data)\u001b[0m\n\u001b[1;32m    949\u001b[0m             \u001b[0;32mif\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mauto_open\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 950\u001b[0;31m                 \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mconnect\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    951\u001b[0m             \u001b[0;32melse\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/opt/conda/lib/python3.9/site-packages/urllib3/connection.py\u001b[0m in \u001b[0;36mconnect\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    199\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0mconnect\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 200\u001b[0;31m         \u001b[0mconn\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_new_conn\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    201\u001b[0m         \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_prepare_conn\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mconn\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/opt/conda/lib/python3.9/site-packages/urllib3/connection.py\u001b[0m in \u001b[0;36m_new_conn\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    180\u001b[0m         \u001b[0;32mexcept\u001b[0m \u001b[0mSocketError\u001b[0m \u001b[0;32mas\u001b[0m \u001b[0me\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 181\u001b[0;31m             raise NewConnectionError(\n\u001b[0m\u001b[1;32m    182\u001b[0m                 \u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m\"Failed to establish a new connection: %s\"\u001b[0m \u001b[0;34m%\u001b[0m \u001b[0me\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;31mNewConnectionError\u001b[0m: <urllib3.connection.HTTPConnection object at 0x7fd0f5c03b50>: Failed to establish a new connection: [Errno 111] Connection refused",
      "\nDuring handling of the above exception, another exception occurred:\n",
      "\u001b[0;31mMaxRetryError\u001b[0m                             Traceback (most recent call last)",
      "\u001b[0;32m/opt/conda/lib/python3.9/site-packages/requests/adapters.py\u001b[0m in \u001b[0;36msend\u001b[0;34m(self, request, stream, timeout, verify, cert, proxies)\u001b[0m\n\u001b[1;32m    438\u001b[0m             \u001b[0;32mif\u001b[0m \u001b[0;32mnot\u001b[0m \u001b[0mchunked\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 439\u001b[0;31m                 resp = conn.urlopen(\n\u001b[0m\u001b[1;32m    440\u001b[0m                     \u001b[0mmethod\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mrequest\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mmethod\u001b[0m\u001b[0;34m,\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/opt/conda/lib/python3.9/site-packages/urllib3/connectionpool.py\u001b[0m in \u001b[0;36murlopen\u001b[0;34m(self, method, url, body, headers, retries, redirect, assert_same_host, timeout, pool_timeout, release_conn, chunked, body_pos, **response_kw)\u001b[0m\n\u001b[1;32m    754\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 755\u001b[0;31m             retries = retries.increment(\n\u001b[0m\u001b[1;32m    756\u001b[0m                 \u001b[0mmethod\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0murl\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0merror\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0me\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0m_pool\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0m_stacktrace\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0msys\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mexc_info\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;36m2\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/opt/conda/lib/python3.9/site-packages/urllib3/util/retry.py\u001b[0m in \u001b[0;36mincrement\u001b[0;34m(self, method, url, response, error, _pool, _stacktrace)\u001b[0m\n\u001b[1;32m    573\u001b[0m         \u001b[0;32mif\u001b[0m \u001b[0mnew_retry\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mis_exhausted\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 574\u001b[0;31m             \u001b[0;32mraise\u001b[0m \u001b[0mMaxRetryError\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0m_pool\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0murl\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0merror\u001b[0m \u001b[0;32mor\u001b[0m \u001b[0mResponseError\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mcause\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    575\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;31mMaxRetryError\u001b[0m: HTTPConnectionPool(host='127.0.0.1', port=7474): Max retries exceeded with url: /db/data/ (Caused by NewConnectionError('<urllib3.connection.HTTPConnection object at 0x7fd0f5c03b50>: Failed to establish a new connection: [Errno 111] Connection refused'))",
      "\nDuring handling of the above exception, another exception occurred:\n",
      "\u001b[0;31mConnectionError\u001b[0m                           Traceback (most recent call last)",
      "\u001b[0;32m<ipython-input-6-cd0c1132beb4>\u001b[0m in \u001b[0;36m<module>\u001b[0;34m\u001b[0m\n\u001b[0;32m----> 1\u001b[0;31m \u001b[0mget_ipython\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mrun_cell_magic\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m'cypher'\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m' http://neo:engmohamed@127.0.0.1:7474/db/data'\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m'MATCH (n:Person) RETURN n\\n'\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m",
      "\u001b[0;32m/opt/conda/lib/python3.9/site-packages/IPython/core/interactiveshell.py\u001b[0m in \u001b[0;36mrun_cell_magic\u001b[0;34m(self, magic_name, line, cell)\u001b[0m\n\u001b[1;32m   2401\u001b[0m             \u001b[0;32mwith\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mbuiltin_trap\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   2402\u001b[0m                 \u001b[0margs\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0;34m(\u001b[0m\u001b[0mmagic_arg_s\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mcell\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m-> 2403\u001b[0;31m                 \u001b[0mresult\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mfn\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m*\u001b[0m\u001b[0margs\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m**\u001b[0m\u001b[0mkwargs\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m   2404\u001b[0m             \u001b[0;32mreturn\u001b[0m \u001b[0mresult\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   2405\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/opt/conda/lib/python3.9/site-packages/decorator.py\u001b[0m in \u001b[0;36mfun\u001b[0;34m(*args, **kw)\u001b[0m\n\u001b[1;32m    230\u001b[0m             \u001b[0;32mif\u001b[0m \u001b[0;32mnot\u001b[0m \u001b[0mkwsyntax\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    231\u001b[0m                 \u001b[0margs\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mkw\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mfix\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0margs\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mkw\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0msig\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 232\u001b[0;31m             \u001b[0;32mreturn\u001b[0m \u001b[0mcaller\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mfunc\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m*\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mextras\u001b[0m \u001b[0;34m+\u001b[0m \u001b[0margs\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m**\u001b[0m\u001b[0mkw\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    233\u001b[0m     \u001b[0mfun\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m__name__\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mfunc\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m__name__\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    234\u001b[0m     \u001b[0mfun\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m__doc__\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mfunc\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m__doc__\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/opt/conda/lib/python3.9/site-packages/IPython/core/magic.py\u001b[0m in \u001b[0;36m<lambda>\u001b[0;34m(f, *a, **k)\u001b[0m\n\u001b[1;32m    185\u001b[0m     \u001b[0;31m# but it's overkill for just that one bit of state.\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    186\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0mmagic_deco\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0marg\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 187\u001b[0;31m         \u001b[0mcall\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0;32mlambda\u001b[0m \u001b[0mf\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m*\u001b[0m\u001b[0ma\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m**\u001b[0m\u001b[0mk\u001b[0m\u001b[0;34m:\u001b[0m \u001b[0mf\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m*\u001b[0m\u001b[0ma\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m**\u001b[0m\u001b[0mk\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    188\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    189\u001b[0m         \u001b[0;32mif\u001b[0m \u001b[0mcallable\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0marg\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/opt/conda/lib/python3.9/site-packages/decorator.py\u001b[0m in \u001b[0;36mfun\u001b[0;34m(*args, **kw)\u001b[0m\n\u001b[1;32m    230\u001b[0m             \u001b[0;32mif\u001b[0m \u001b[0;32mnot\u001b[0m \u001b[0mkwsyntax\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    231\u001b[0m                 \u001b[0margs\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mkw\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mfix\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0margs\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mkw\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0msig\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 232\u001b[0;31m             \u001b[0;32mreturn\u001b[0m \u001b[0mcaller\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mfunc\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m*\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mextras\u001b[0m \u001b[0;34m+\u001b[0m \u001b[0margs\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m**\u001b[0m\u001b[0mkw\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    233\u001b[0m     \u001b[0mfun\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m__name__\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mfunc\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m__name__\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    234\u001b[0m     \u001b[0mfun\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m__doc__\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mfunc\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m__doc__\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/opt/conda/lib/python3.9/site-packages/IPython/core/magic.py\u001b[0m in \u001b[0;36m<lambda>\u001b[0;34m(f, *a, **k)\u001b[0m\n\u001b[1;32m    185\u001b[0m     \u001b[0;31m# but it's overkill for just that one bit of state.\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    186\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0mmagic_deco\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0marg\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 187\u001b[0;31m         \u001b[0mcall\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0;32mlambda\u001b[0m \u001b[0mf\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m*\u001b[0m\u001b[0ma\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m**\u001b[0m\u001b[0mk\u001b[0m\u001b[0;34m:\u001b[0m \u001b[0mf\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m*\u001b[0m\u001b[0ma\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m**\u001b[0m\u001b[0mk\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    188\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    189\u001b[0m         \u001b[0;32mif\u001b[0m \u001b[0mcallable\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0marg\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/opt/conda/lib/python3.9/site-packages/cypher/magic.py\u001b[0m in \u001b[0;36mexecute\u001b[0;34m(self, line, cell, local_ns)\u001b[0m\n\u001b[1;32m    106\u001b[0m         \u001b[0muser_ns\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mupdate\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mlocal_ns\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    107\u001b[0m         \u001b[0mparsed\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mparse\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"\"\"{0}\\n{1}\"\"\"\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mformat\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mline\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mcell\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 108\u001b[0;31m         \u001b[0mconn\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mConnection\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mget\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mparsed\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;34m'as'\u001b[0m\u001b[0;34m]\u001b[0m \u001b[0;32mor\u001b[0m \u001b[0mparsed\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;34m'uri'\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mparsed\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;34m'as'\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    109\u001b[0m         \u001b[0mfirst_word\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mparsed\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;34m'cypher'\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0msplit\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;36m1\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;36m1\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    110\u001b[0m         \u001b[0;32mif\u001b[0m \u001b[0mfirst_word\u001b[0m \u001b[0;32mand\u001b[0m \u001b[0mfirst_word\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;36m0\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mlower\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m \u001b[0;34m==\u001b[0m \u001b[0;34m'persist'\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/opt/conda/lib/python3.9/site-packages/cypher/connection.py\u001b[0m in \u001b[0;36mget\u001b[0;34m(cls, descriptor, alias)\u001b[0m\n\u001b[1;32m     45\u001b[0m                 \u001b[0mcls\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mcurrent\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mconn\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     46\u001b[0m             \u001b[0;32melse\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m---> 47\u001b[0;31m                 \u001b[0mcls\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mcurrent\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mConnection\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mdescriptor\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0malias\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m     48\u001b[0m         \u001b[0;32mif\u001b[0m \u001b[0mcls\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mcurrent\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     49\u001b[0m             \u001b[0;32mreturn\u001b[0m \u001b[0mcls\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mcurrent\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/opt/conda/lib/python3.9/site-packages/cypher/connection.py\u001b[0m in \u001b[0;36m__init__\u001b[0;34m(self, connect_str, alias)\u001b[0m\n\u001b[1;32m     24\u001b[0m                 \u001b[0mgdb\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mGraphDatabase\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mconnections\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0mconnect_str\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     25\u001b[0m             \u001b[0;32melse\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m---> 26\u001b[0;31m                 \u001b[0mgdb\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mGraphDatabase\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mconnect_str\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m     27\u001b[0m                 \u001b[0malias\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0malias\u001b[0m \u001b[0;32mor\u001b[0m \u001b[0mconnect_str\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     28\u001b[0m         \u001b[0;32mexcept\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/opt/conda/lib/python3.9/site-packages/neo4jrestclient/client.py\u001b[0m in \u001b[0;36m__init__\u001b[0;34m(self, url, username, password, cert_file, key_file)\u001b[0m\n\u001b[1;32m     77\u001b[0m         \u001b[0;32melse\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     78\u001b[0m             \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0murl\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0;34m\"%s/\"\u001b[0m \u001b[0;34m%\u001b[0m \u001b[0murl\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m---> 79\u001b[0;31m         \u001b[0mresponse\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mRequest\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m**\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_auth\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mget\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0murl\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m     80\u001b[0m         \u001b[0;32mif\u001b[0m \u001b[0mresponse\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mstatus_code\u001b[0m \u001b[0;34m==\u001b[0m \u001b[0;36m200\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     81\u001b[0m             \u001b[0mresponse_json\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mresponse\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mjson\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/opt/conda/lib/python3.9/site-packages/neo4jrestclient/request.py\u001b[0m in \u001b[0;36mget\u001b[0;34m(self, url, headers)\u001b[0m\n\u001b[1;32m     61\u001b[0m         \u001b[0mReturns\u001b[0m \u001b[0mthe\u001b[0m \u001b[0mresponse\u001b[0m \u001b[0mobject\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     62\u001b[0m         \"\"\"\n\u001b[0;32m---> 63\u001b[0;31m         \u001b[0;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_request\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m'GET'\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0murl\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mheaders\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mheaders\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m     64\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     65\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0mpost\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0murl\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mdata\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mheaders\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/opt/conda/lib/python3.9/site-packages/neo4jrestclient/request.py\u001b[0m in \u001b[0;36m_request\u001b[0;34m(self, method, url, data, headers)\u001b[0m\n\u001b[1;32m    194\u001b[0m         \u001b[0;32mtry\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    195\u001b[0m             \u001b[0mmethod\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mmethod\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mlower\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 196\u001b[0;31m             response = getattr(session, method)(root_uri, headers=headers,\n\u001b[0m\u001b[1;32m    197\u001b[0m                                                 \u001b[0mdata\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mdata\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mcert\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mcert\u001b[0m\u001b[0;34m,\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    198\u001b[0m                                                 auth=auth, verify=verify)\n",
      "\u001b[0;32m/opt/conda/lib/python3.9/site-packages/requests/sessions.py\u001b[0m in \u001b[0;36mget\u001b[0;34m(self, url, **kwargs)\u001b[0m\n\u001b[1;32m    553\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    554\u001b[0m         \u001b[0mkwargs\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0msetdefault\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m'allow_redirects'\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;32mTrue\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 555\u001b[0;31m         \u001b[0;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mrequest\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m'GET'\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0murl\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m**\u001b[0m\u001b[0mkwargs\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    556\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    557\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0moptions\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0murl\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m**\u001b[0m\u001b[0mkwargs\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/opt/conda/lib/python3.9/site-packages/requests/sessions.py\u001b[0m in \u001b[0;36mrequest\u001b[0;34m(self, method, url, params, data, headers, cookies, files, auth, timeout, allow_redirects, proxies, hooks, stream, verify, cert, json)\u001b[0m\n\u001b[1;32m    540\u001b[0m         }\n\u001b[1;32m    541\u001b[0m         \u001b[0msend_kwargs\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mupdate\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0msettings\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 542\u001b[0;31m         \u001b[0mresp\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0msend\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mprep\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m**\u001b[0m\u001b[0msend_kwargs\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    543\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    544\u001b[0m         \u001b[0;32mreturn\u001b[0m \u001b[0mresp\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/opt/conda/lib/python3.9/site-packages/requests/sessions.py\u001b[0m in \u001b[0;36msend\u001b[0;34m(self, request, **kwargs)\u001b[0m\n\u001b[1;32m    653\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    654\u001b[0m         \u001b[0;31m# Send the request\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 655\u001b[0;31m         \u001b[0mr\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0madapter\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0msend\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mrequest\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m**\u001b[0m\u001b[0mkwargs\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    656\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    657\u001b[0m         \u001b[0;31m# Total elapsed time of the request (approximately)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/opt/conda/lib/python3.9/site-packages/requests/adapters.py\u001b[0m in \u001b[0;36msend\u001b[0;34m(self, request, stream, timeout, verify, cert, proxies)\u001b[0m\n\u001b[1;32m    514\u001b[0m                 \u001b[0;32mraise\u001b[0m \u001b[0mSSLError\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0me\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mrequest\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mrequest\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    515\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 516\u001b[0;31m             \u001b[0;32mraise\u001b[0m \u001b[0mConnectionError\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0me\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mrequest\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mrequest\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    517\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    518\u001b[0m         \u001b[0;32mexcept\u001b[0m \u001b[0mClosedPoolError\u001b[0m \u001b[0;32mas\u001b[0m \u001b[0me\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;31mConnectionError\u001b[0m: HTTPConnectionPool(host='127.0.0.1', port=7474): Max retries exceeded with url: /db/data/ (Caused by NewConnectionError('<urllib3.connection.HTTPConnection object at 0x7fd0f5c03b50>: Failed to establish a new connection: [Errno 111] Connection refused'))"
     ]
    }
   ],
   "source": [
    "%%cypher  http://neo4:engmohamed@127.0.0.1:7474/db/data   \n",
    "MATCH (n:Person) RETURN n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Get the label of those nodes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "133 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>LABELS(n)</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']]]"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher  http://neo4j:engmohamed@127.0.0.1:7474/db/data\n",
    "MATCH (n:Person) RETURN LABELS(n)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Get the node of \"Tom Hanks\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>n</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1956, &#x27;name&#x27;: &#x27;Tom Hanks&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'born': 1956, 'name': 'Tom Hanks'}]]"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher  http://neo4j:engmohamed@127.0.0.1:7474/db/data   \n",
    "MATCH (n:Person {name:\"Tom Hanks\"}) RETURN n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "###  Projections\n",
    "\n",
    "#### Get the title, release_year of movies\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "38 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>m.title</th>\n",
       "        <th>m.released</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Matrix</td>\n",
       "        <td>1999</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Matrix Reloaded</td>\n",
       "        <td>2003</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Matrix Revolutions</td>\n",
       "        <td>2003</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Devil&#x27;s Advocate</td>\n",
       "        <td>1997</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>A Few Good Men</td>\n",
       "        <td>1992</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Top Gun</td>\n",
       "        <td>1986</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Jerry Maguire</td>\n",
       "        <td>2000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Stand By Me</td>\n",
       "        <td>1986</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>As Good as It Gets</td>\n",
       "        <td>1997</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>What Dreams May Come</td>\n",
       "        <td>1998</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Snow Falling on Cedars</td>\n",
       "        <td>1999</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>You&#x27;ve Got Mail</td>\n",
       "        <td>1998</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Sleepless in Seattle</td>\n",
       "        <td>1993</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Joe Versus the Volcano</td>\n",
       "        <td>1990</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>When Harry Met Sally</td>\n",
       "        <td>1998</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>That Thing You Do</td>\n",
       "        <td>1996</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Replacements</td>\n",
       "        <td>2000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>RescueDawn</td>\n",
       "        <td>2006</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Birdcage</td>\n",
       "        <td>1996</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Unforgiven</td>\n",
       "        <td>1992</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Johnny Mnemonic</td>\n",
       "        <td>1995</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Cloud Atlas</td>\n",
       "        <td>2012</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Da Vinci Code</td>\n",
       "        <td>2006</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>V for Vendetta</td>\n",
       "        <td>2006</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Speed Racer</td>\n",
       "        <td>2008</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Ninja Assassin</td>\n",
       "        <td>2009</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Green Mile</td>\n",
       "        <td>1999</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Frost/Nixon</td>\n",
       "        <td>2008</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Hoffa</td>\n",
       "        <td>1992</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Apollo 13</td>\n",
       "        <td>1995</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Twister</td>\n",
       "        <td>1996</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Cast Away</td>\n",
       "        <td>2000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>One Flew Over the Cuckoo&#x27;s Nest</td>\n",
       "        <td>1975</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Something&#x27;s Gotta Give</td>\n",
       "        <td>2003</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Bicentennial Man</td>\n",
       "        <td>1999</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Charlie Wilson&#x27;s War</td>\n",
       "        <td>2007</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Polar Express</td>\n",
       "        <td>2004</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>A League of Their Own</td>\n",
       "        <td>1992</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['The Matrix', 1999],\n",
       " ['The Matrix Reloaded', 2003],\n",
       " ['The Matrix Revolutions', 2003],\n",
       " [\"The Devil's Advocate\", 1997],\n",
       " ['A Few Good Men', 1992],\n",
       " ['Top Gun', 1986],\n",
       " ['Jerry Maguire', 2000],\n",
       " ['Stand By Me', 1986],\n",
       " ['As Good as It Gets', 1997],\n",
       " ['What Dreams May Come', 1998],\n",
       " ['Snow Falling on Cedars', 1999],\n",
       " [\"You've Got Mail\", 1998],\n",
       " ['Sleepless in Seattle', 1993],\n",
       " ['Joe Versus the Volcano', 1990],\n",
       " ['When Harry Met Sally', 1998],\n",
       " ['That Thing You Do', 1996],\n",
       " ['The Replacements', 2000],\n",
       " ['RescueDawn', 2006],\n",
       " ['The Birdcage', 1996],\n",
       " ['Unforgiven', 1992],\n",
       " ['Johnny Mnemonic', 1995],\n",
       " ['Cloud Atlas', 2012],\n",
       " ['The Da Vinci Code', 2006],\n",
       " ['V for Vendetta', 2006],\n",
       " ['Speed Racer', 2008],\n",
       " ['Ninja Assassin', 2009],\n",
       " ['The Green Mile', 1999],\n",
       " ['Frost/Nixon', 2008],\n",
       " ['Hoffa', 1992],\n",
       " ['Apollo 13', 1995],\n",
       " ['Twister', 1996],\n",
       " ['Cast Away', 2000],\n",
       " [\"One Flew Over the Cuckoo's Nest\", 1975],\n",
       " [\"Something's Gotta Give\", 2003],\n",
       " ['Bicentennial Man', 1999],\n",
       " [\"Charlie Wilson's War\", 2007],\n",
       " ['The Polar Express', 2004],\n",
       " ['A League of Their Own', 1992]]"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher  http://neo4j:engmohamed@127.0.0.1:7474/db/data \n",
    "MATCH (m:Movie) \n",
    "RETURN m.title, m.released"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Matching By a relationship (Querying)\n",
    "#### Get the people and their relationships to movies (regardless of the type of the relationship)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "10 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>m</th>\n",
       "        <th>p</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &#x27;Welcome to the Real World&#x27;, &#x27;title&#x27;: &#x27;The Matrix&#x27;, &#x27;released&#x27;: 1999}</td>\n",
       "        <td>{&#x27;born&#x27;: 1978, &#x27;name&#x27;: &#x27;Emil Eifrem&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &#x27;Welcome to the Real World&#x27;, &#x27;title&#x27;: &#x27;The Matrix&#x27;, &#x27;released&#x27;: 1999}</td>\n",
       "        <td>{&#x27;born&#x27;: 1952, &#x27;name&#x27;: &#x27;Joel Silver&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &#x27;Welcome to the Real World&#x27;, &#x27;title&#x27;: &#x27;The Matrix&#x27;, &#x27;released&#x27;: 1999}</td>\n",
       "        <td>{&#x27;born&#x27;: 1965, &#x27;name&#x27;: &#x27;Lana Wachowski&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &#x27;Welcome to the Real World&#x27;, &#x27;title&#x27;: &#x27;The Matrix&#x27;, &#x27;released&#x27;: 1999}</td>\n",
       "        <td>{&#x27;born&#x27;: 1967, &#x27;name&#x27;: &#x27;Lilly Wachowski&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &#x27;Welcome to the Real World&#x27;, &#x27;title&#x27;: &#x27;The Matrix&#x27;, &#x27;released&#x27;: 1999}</td>\n",
       "        <td>{&#x27;born&#x27;: 1960, &#x27;name&#x27;: &#x27;Hugo Weaving&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &#x27;Welcome to the Real World&#x27;, &#x27;title&#x27;: &#x27;The Matrix&#x27;, &#x27;released&#x27;: 1999}</td>\n",
       "        <td>{&#x27;born&#x27;: 1961, &#x27;name&#x27;: &#x27;Laurence Fishburne&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &#x27;Welcome to the Real World&#x27;, &#x27;title&#x27;: &#x27;The Matrix&#x27;, &#x27;released&#x27;: 1999}</td>\n",
       "        <td>{&#x27;born&#x27;: 1967, &#x27;name&#x27;: &#x27;Carrie-Anne Moss&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &#x27;Welcome to the Real World&#x27;, &#x27;title&#x27;: &#x27;The Matrix&#x27;, &#x27;released&#x27;: 1999}</td>\n",
       "        <td>{&#x27;born&#x27;: 1964, &#x27;name&#x27;: &#x27;Keanu Reeves&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &#x27;Free your mind&#x27;, &#x27;title&#x27;: &#x27;The Matrix Reloaded&#x27;, &#x27;released&#x27;: 2003}</td>\n",
       "        <td>{&#x27;born&#x27;: 1952, &#x27;name&#x27;: &#x27;Joel Silver&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &#x27;Free your mind&#x27;, &#x27;title&#x27;: &#x27;The Matrix Reloaded&#x27;, &#x27;released&#x27;: 2003}</td>\n",
       "        <td>{&#x27;born&#x27;: 1965, &#x27;name&#x27;: &#x27;Lana Wachowski&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'tagline': 'Welcome to the Real World',\n",
       "   'title': 'The Matrix',\n",
       "   'released': 1999},\n",
       "  {'born': 1978, 'name': 'Emil Eifrem'}],\n",
       " [{'tagline': 'Welcome to the Real World',\n",
       "   'title': 'The Matrix',\n",
       "   'released': 1999},\n",
       "  {'born': 1952, 'name': 'Joel Silver'}],\n",
       " [{'tagline': 'Welcome to the Real World',\n",
       "   'title': 'The Matrix',\n",
       "   'released': 1999},\n",
       "  {'born': 1965, 'name': 'Lana Wachowski'}],\n",
       " [{'tagline': 'Welcome to the Real World',\n",
       "   'title': 'The Matrix',\n",
       "   'released': 1999},\n",
       "  {'born': 1967, 'name': 'Lilly Wachowski'}],\n",
       " [{'tagline': 'Welcome to the Real World',\n",
       "   'title': 'The Matrix',\n",
       "   'released': 1999},\n",
       "  {'born': 1960, 'name': 'Hugo Weaving'}],\n",
       " [{'tagline': 'Welcome to the Real World',\n",
       "   'title': 'The Matrix',\n",
       "   'released': 1999},\n",
       "  {'born': 1961, 'name': 'Laurence Fishburne'}],\n",
       " [{'tagline': 'Welcome to the Real World',\n",
       "   'title': 'The Matrix',\n",
       "   'released': 1999},\n",
       "  {'born': 1967, 'name': 'Carrie-Anne Moss'}],\n",
       " [{'tagline': 'Welcome to the Real World',\n",
       "   'title': 'The Matrix',\n",
       "   'released': 1999},\n",
       "  {'born': 1964, 'name': 'Keanu Reeves'}],\n",
       " [{'tagline': 'Free your mind',\n",
       "   'title': 'The Matrix Reloaded',\n",
       "   'released': 2003},\n",
       "  {'born': 1952, 'name': 'Joel Silver'}],\n",
       " [{'tagline': 'Free your mind',\n",
       "   'title': 'The Matrix Reloaded',\n",
       "   'released': 2003},\n",
       "  {'born': 1965, 'name': 'Lana Wachowski'}]]"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher  http://neo4j:engmohamed@127.0.0.1:7474/db/data\n",
    "MATCH (p:Person) -->(m:Movie) \n",
    "RETURN * LIMIT 10"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Get all the movies and people who acted in those movies"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "10 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>m</th>\n",
       "        <th>p</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &#x27;Welcome to the Real World&#x27;, &#x27;title&#x27;: &#x27;The Matrix&#x27;, &#x27;released&#x27;: 1999}</td>\n",
       "        <td>{&#x27;born&#x27;: 1978, &#x27;name&#x27;: &#x27;Emil Eifrem&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &#x27;Welcome to the Real World&#x27;, &#x27;title&#x27;: &#x27;The Matrix&#x27;, &#x27;released&#x27;: 1999}</td>\n",
       "        <td>{&#x27;born&#x27;: 1960, &#x27;name&#x27;: &#x27;Hugo Weaving&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &#x27;Welcome to the Real World&#x27;, &#x27;title&#x27;: &#x27;The Matrix&#x27;, &#x27;released&#x27;: 1999}</td>\n",
       "        <td>{&#x27;born&#x27;: 1961, &#x27;name&#x27;: &#x27;Laurence Fishburne&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &#x27;Welcome to the Real World&#x27;, &#x27;title&#x27;: &#x27;The Matrix&#x27;, &#x27;released&#x27;: 1999}</td>\n",
       "        <td>{&#x27;born&#x27;: 1967, &#x27;name&#x27;: &#x27;Carrie-Anne Moss&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &#x27;Welcome to the Real World&#x27;, &#x27;title&#x27;: &#x27;The Matrix&#x27;, &#x27;released&#x27;: 1999}</td>\n",
       "        <td>{&#x27;born&#x27;: 1964, &#x27;name&#x27;: &#x27;Keanu Reeves&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &#x27;Free your mind&#x27;, &#x27;title&#x27;: &#x27;The Matrix Reloaded&#x27;, &#x27;released&#x27;: 2003}</td>\n",
       "        <td>{&#x27;born&#x27;: 1960, &#x27;name&#x27;: &#x27;Hugo Weaving&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &#x27;Free your mind&#x27;, &#x27;title&#x27;: &#x27;The Matrix Reloaded&#x27;, &#x27;released&#x27;: 2003}</td>\n",
       "        <td>{&#x27;born&#x27;: 1961, &#x27;name&#x27;: &#x27;Laurence Fishburne&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &#x27;Free your mind&#x27;, &#x27;title&#x27;: &#x27;The Matrix Reloaded&#x27;, &#x27;released&#x27;: 2003}</td>\n",
       "        <td>{&#x27;born&#x27;: 1967, &#x27;name&#x27;: &#x27;Carrie-Anne Moss&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &#x27;Free your mind&#x27;, &#x27;title&#x27;: &#x27;The Matrix Reloaded&#x27;, &#x27;released&#x27;: 2003}</td>\n",
       "        <td>{&#x27;born&#x27;: 1964, &#x27;name&#x27;: &#x27;Keanu Reeves&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &#x27;Everything that has a beginning has an end&#x27;, &#x27;title&#x27;: &#x27;The Matrix Revolutions&#x27;, &#x27;released&#x27;: 2003}</td>\n",
       "        <td>{&#x27;born&#x27;: 1960, &#x27;name&#x27;: &#x27;Hugo Weaving&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'tagline': 'Welcome to the Real World',\n",
       "   'title': 'The Matrix',\n",
       "   'released': 1999},\n",
       "  {'born': 1978, 'name': 'Emil Eifrem'}],\n",
       " [{'tagline': 'Welcome to the Real World',\n",
       "   'title': 'The Matrix',\n",
       "   'released': 1999},\n",
       "  {'born': 1960, 'name': 'Hugo Weaving'}],\n",
       " [{'tagline': 'Welcome to the Real World',\n",
       "   'title': 'The Matrix',\n",
       "   'released': 1999},\n",
       "  {'born': 1961, 'name': 'Laurence Fishburne'}],\n",
       " [{'tagline': 'Welcome to the Real World',\n",
       "   'title': 'The Matrix',\n",
       "   'released': 1999},\n",
       "  {'born': 1967, 'name': 'Carrie-Anne Moss'}],\n",
       " [{'tagline': 'Welcome to the Real World',\n",
       "   'title': 'The Matrix',\n",
       "   'released': 1999},\n",
       "  {'born': 1964, 'name': 'Keanu Reeves'}],\n",
       " [{'tagline': 'Free your mind',\n",
       "   'title': 'The Matrix Reloaded',\n",
       "   'released': 2003},\n",
       "  {'born': 1960, 'name': 'Hugo Weaving'}],\n",
       " [{'tagline': 'Free your mind',\n",
       "   'title': 'The Matrix Reloaded',\n",
       "   'released': 2003},\n",
       "  {'born': 1961, 'name': 'Laurence Fishburne'}],\n",
       " [{'tagline': 'Free your mind',\n",
       "   'title': 'The Matrix Reloaded',\n",
       "   'released': 2003},\n",
       "  {'born': 1967, 'name': 'Carrie-Anne Moss'}],\n",
       " [{'tagline': 'Free your mind',\n",
       "   'title': 'The Matrix Reloaded',\n",
       "   'released': 2003},\n",
       "  {'born': 1964, 'name': 'Keanu Reeves'}],\n",
       " [{'tagline': 'Everything that has a beginning has an end',\n",
       "   'title': 'The Matrix Revolutions',\n",
       "   'released': 2003},\n",
       "  {'born': 1960, 'name': 'Hugo Weaving'}]]"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher  http://neo4j:engmohamed@127.0.0.1:7474/db/data \n",
    "MATCH (p:Person) -[:ACTED_IN]->(m:Movie) \n",
    "RETURN * LIMIT 10"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Filtering (WHERE Clause)\n",
    "\n",
    "####  What were the movies that \"Tom Hanks\" acted in"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "12 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>m.title</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Apollo 13</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>You&#x27;ve Got Mail</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>A League of Their Own</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Joe Versus the Volcano</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>That Thing You Do</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Da Vinci Code</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Cloud Atlas</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Cast Away</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Green Mile</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Sleepless in Seattle</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Polar Express</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Charlie Wilson&#x27;s War</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['Apollo 13'],\n",
       " [\"You've Got Mail\"],\n",
       " ['A League of Their Own'],\n",
       " ['Joe Versus the Volcano'],\n",
       " ['That Thing You Do'],\n",
       " ['The Da Vinci Code'],\n",
       " ['Cloud Atlas'],\n",
       " ['Cast Away'],\n",
       " ['The Green Mile'],\n",
       " ['Sleepless in Seattle'],\n",
       " ['The Polar Express'],\n",
       " [\"Charlie Wilson's War\"]]"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher  http://neo4j:engmohamed@127.0.0.1:7474/db/data \n",
    "MATCH (p:Person) -[:ACTED_IN]->(m:Movie) \n",
    "WHERE p.name=\"Tom Hanks\" \n",
    "RETURN m.title\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "####  What were the movies released in 1990s"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "19 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>m.title</th>\n",
       "        <th>m.released</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Matrix</td>\n",
       "        <td>1999</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Devil&#x27;s Advocate</td>\n",
       "        <td>1997</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>A Few Good Men</td>\n",
       "        <td>1992</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>As Good as It Gets</td>\n",
       "        <td>1997</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>What Dreams May Come</td>\n",
       "        <td>1998</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Snow Falling on Cedars</td>\n",
       "        <td>1999</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>You&#x27;ve Got Mail</td>\n",
       "        <td>1998</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Sleepless in Seattle</td>\n",
       "        <td>1993</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>When Harry Met Sally</td>\n",
       "        <td>1998</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>That Thing You Do</td>\n",
       "        <td>1996</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Birdcage</td>\n",
       "        <td>1996</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Unforgiven</td>\n",
       "        <td>1992</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Johnny Mnemonic</td>\n",
       "        <td>1995</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Green Mile</td>\n",
       "        <td>1999</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Hoffa</td>\n",
       "        <td>1992</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Apollo 13</td>\n",
       "        <td>1995</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Twister</td>\n",
       "        <td>1996</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Bicentennial Man</td>\n",
       "        <td>1999</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>A League of Their Own</td>\n",
       "        <td>1992</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['The Matrix', 1999],\n",
       " [\"The Devil's Advocate\", 1997],\n",
       " ['A Few Good Men', 1992],\n",
       " ['As Good as It Gets', 1997],\n",
       " ['What Dreams May Come', 1998],\n",
       " ['Snow Falling on Cedars', 1999],\n",
       " [\"You've Got Mail\", 1998],\n",
       " ['Sleepless in Seattle', 1993],\n",
       " ['When Harry Met Sally', 1998],\n",
       " ['That Thing You Do', 1996],\n",
       " ['The Birdcage', 1996],\n",
       " ['Unforgiven', 1992],\n",
       " ['Johnny Mnemonic', 1995],\n",
       " ['The Green Mile', 1999],\n",
       " ['Hoffa', 1992],\n",
       " ['Apollo 13', 1995],\n",
       " ['Twister', 1996],\n",
       " ['Bicentennial Man', 1999],\n",
       " ['A League of Their Own', 1992]]"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:engmohamed@127.0.0.1:7474/db/data   \n",
    "MATCH (m:Movie) \n",
    "WHERE m.released>1990 AND m.released<2000 \n",
    "RETURN m.title, m.released\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Who Directed \"Cloud Atlas\"  movie?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>p.name</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Tom Tykwer</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Lana Wachowski</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Lilly Wachowski</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['Tom Tykwer'], ['Lana Wachowski'], ['Lilly Wachowski']]"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher  http://neo4j:engmohamed@127.0.0.1:7474/db/data   \n",
    "MATCH (p:Person) -[:DIRECTED]->(m:Movie) \n",
    "WHERE m.title=\"Cloud Atlas\" \n",
    "RETURN p.name\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Get Actors and movies , but skip who also Directed Movie at all\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "5 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>p.name</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>James Marshall</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Werner Herzog</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Tom Hanks</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Clint Eastwood</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Danny DeVito</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['James Marshall'],\n",
       " ['Werner Herzog'],\n",
       " ['Tom Hanks'],\n",
       " ['Clint Eastwood'],\n",
       " ['Danny DeVito']]"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher  http://neo4j:engmohamed@127.0.0.1:7474/db/data\n",
    "MATCH (p:Person)-[:ACTED_IN]->(m)\n",
    "WHERE (p)-[:DIRECTED]->()\n",
    "RETURN DISTINCT p.name"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "###  Unique Results (Distinct)\n",
    "#### Get DISTINCT Labels in your GraphDB\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>Labels</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Movie&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[['Movie']], [['Person']]]"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher  http://neo4j:engmohamed@127.0.0.1:7474/db/data\n",
    "MATCH (n) \n",
    "RETURN DISTINCT labels(n) AS Labels\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "####  Get Tom Hanks Co-Actors (and in which movies)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "39 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>coActors.name</th>\n",
       "        <th>m.title</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Ed Harris</td>\n",
       "        <td>Apollo 13</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Gary Sinise</td>\n",
       "        <td>Apollo 13</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Kevin Bacon</td>\n",
       "        <td>Apollo 13</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Bill Paxton</td>\n",
       "        <td>Apollo 13</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Parker Posey</td>\n",
       "        <td>You&#x27;ve Got Mail</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Greg Kinnear</td>\n",
       "        <td>You&#x27;ve Got Mail</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Meg Ryan</td>\n",
       "        <td>You&#x27;ve Got Mail</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Steve Zahn</td>\n",
       "        <td>You&#x27;ve Got Mail</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Dave Chappelle</td>\n",
       "        <td>You&#x27;ve Got Mail</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Madonna</td>\n",
       "        <td>A League of Their Own</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Rosie O&#x27;Donnell</td>\n",
       "        <td>A League of Their Own</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Geena Davis</td>\n",
       "        <td>A League of Their Own</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Bill Paxton</td>\n",
       "        <td>A League of Their Own</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Lori Petty</td>\n",
       "        <td>A League of Their Own</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Nathan Lane</td>\n",
       "        <td>Joe Versus the Volcano</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Meg Ryan</td>\n",
       "        <td>Joe Versus the Volcano</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Liv Tyler</td>\n",
       "        <td>That Thing You Do</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Charlize Theron</td>\n",
       "        <td>That Thing You Do</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Ian McKellen</td>\n",
       "        <td>The Da Vinci Code</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Audrey Tautou</td>\n",
       "        <td>The Da Vinci Code</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Paul Bettany</td>\n",
       "        <td>The Da Vinci Code</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Jim Broadbent</td>\n",
       "        <td>Cloud Atlas</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Halle Berry</td>\n",
       "        <td>Cloud Atlas</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Hugo Weaving</td>\n",
       "        <td>Cloud Atlas</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Helen Hunt</td>\n",
       "        <td>Cast Away</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Sam Rockwell</td>\n",
       "        <td>The Green Mile</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Bonnie Hunt</td>\n",
       "        <td>The Green Mile</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Patricia Clarkson</td>\n",
       "        <td>The Green Mile</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>James Cromwell</td>\n",
       "        <td>The Green Mile</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Michael Clarke Duncan</td>\n",
       "        <td>The Green Mile</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>David Morse</td>\n",
       "        <td>The Green Mile</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Gary Sinise</td>\n",
       "        <td>The Green Mile</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Meg Ryan</td>\n",
       "        <td>Sleepless in Seattle</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Victor Garber</td>\n",
       "        <td>Sleepless in Seattle</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Bill Pullman</td>\n",
       "        <td>Sleepless in Seattle</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Rita Wilson</td>\n",
       "        <td>Sleepless in Seattle</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Rosie O&#x27;Donnell</td>\n",
       "        <td>Sleepless in Seattle</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Julia Roberts</td>\n",
       "        <td>Charlie Wilson&#x27;s War</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Philip Seymour Hoffman</td>\n",
       "        <td>Charlie Wilson&#x27;s War</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['Ed Harris', 'Apollo 13'],\n",
       " ['Gary Sinise', 'Apollo 13'],\n",
       " ['Kevin Bacon', 'Apollo 13'],\n",
       " ['Bill Paxton', 'Apollo 13'],\n",
       " ['Parker Posey', \"You've Got Mail\"],\n",
       " ['Greg Kinnear', \"You've Got Mail\"],\n",
       " ['Meg Ryan', \"You've Got Mail\"],\n",
       " ['Steve Zahn', \"You've Got Mail\"],\n",
       " ['Dave Chappelle', \"You've Got Mail\"],\n",
       " ['Madonna', 'A League of Their Own'],\n",
       " [\"Rosie O'Donnell\", 'A League of Their Own'],\n",
       " ['Geena Davis', 'A League of Their Own'],\n",
       " ['Bill Paxton', 'A League of Their Own'],\n",
       " ['Lori Petty', 'A League of Their Own'],\n",
       " ['Nathan Lane', 'Joe Versus the Volcano'],\n",
       " ['Meg Ryan', 'Joe Versus the Volcano'],\n",
       " ['Liv Tyler', 'That Thing You Do'],\n",
       " ['Charlize Theron', 'That Thing You Do'],\n",
       " ['Ian McKellen', 'The Da Vinci Code'],\n",
       " ['Audrey Tautou', 'The Da Vinci Code'],\n",
       " ['Paul Bettany', 'The Da Vinci Code'],\n",
       " ['Jim Broadbent', 'Cloud Atlas'],\n",
       " ['Halle Berry', 'Cloud Atlas'],\n",
       " ['Hugo Weaving', 'Cloud Atlas'],\n",
       " ['Helen Hunt', 'Cast Away'],\n",
       " ['Sam Rockwell', 'The Green Mile'],\n",
       " ['Bonnie Hunt', 'The Green Mile'],\n",
       " ['Patricia Clarkson', 'The Green Mile'],\n",
       " ['James Cromwell', 'The Green Mile'],\n",
       " ['Michael Clarke Duncan', 'The Green Mile'],\n",
       " ['David Morse', 'The Green Mile'],\n",
       " ['Gary Sinise', 'The Green Mile'],\n",
       " ['Meg Ryan', 'Sleepless in Seattle'],\n",
       " ['Victor Garber', 'Sleepless in Seattle'],\n",
       " ['Bill Pullman', 'Sleepless in Seattle'],\n",
       " ['Rita Wilson', 'Sleepless in Seattle'],\n",
       " [\"Rosie O'Donnell\", 'Sleepless in Seattle'],\n",
       " ['Julia Roberts', \"Charlie Wilson's War\"],\n",
       " ['Philip Seymour Hoffman', \"Charlie Wilson's War\"]]"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher  http://neo4j:engmohamed@127.0.0.1:7474/db/data\n",
    "MATCH (:Person{name:\"Tom Hanks\"}) -[:ACTED_IN]->(m:Movie)<-[:ACTED_IN]-(coActors) \n",
    "RETURN coActors.name, m.title"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### How people are related to (Acted_IN, Directed, Produced, etc) to the \"Cloud Atlas\" movie?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "10 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>people.name</th>\n",
       "        <th>Type(relatedTo)</th>\n",
       "        <th>roles_if_Actor</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Tom Hanks</td>\n",
       "        <td>ACTED_IN</td>\n",
       "        <td>{&#x27;roles&#x27;: [&#x27;Zachry&#x27;, &#x27;Dr. Henry Goose&#x27;, &#x27;Isaac Sachs&#x27;, &#x27;Dermot Hoggins&#x27;]}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Jim Broadbent</td>\n",
       "        <td>ACTED_IN</td>\n",
       "        <td>{&#x27;roles&#x27;: [&#x27;Vyvyan Ayrs&#x27;, &#x27;Captain Molyneux&#x27;, &#x27;Timothy Cavendish&#x27;]}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>David Mitchell</td>\n",
       "        <td>WROTE</td>\n",
       "        <td>{}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Tom Tykwer</td>\n",
       "        <td>DIRECTED</td>\n",
       "        <td>{}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Lana Wachowski</td>\n",
       "        <td>DIRECTED</td>\n",
       "        <td>{}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Stefan Arndt</td>\n",
       "        <td>PRODUCED</td>\n",
       "        <td>{}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Jessica Thompson</td>\n",
       "        <td>REVIEWED</td>\n",
       "        <td>{&#x27;summary&#x27;: &#x27;An amazing journey&#x27;, &#x27;rating&#x27;: 95}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Halle Berry</td>\n",
       "        <td>ACTED_IN</td>\n",
       "        <td>{&#x27;roles&#x27;: [&#x27;Luisa Rey&#x27;, &#x27;Jocasta Ayrs&#x27;, &#x27;Ovid&#x27;, &#x27;Meronym&#x27;]}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Hugo Weaving</td>\n",
       "        <td>ACTED_IN</td>\n",
       "        <td>{&#x27;roles&#x27;: [&#x27;Bill Smoke&#x27;, &#x27;Haskell Moore&#x27;, &#x27;Tadeusz Kesselring&#x27;, &#x27;Nurse Noakes&#x27;, &#x27;Boardman Mephi&#x27;, &#x27;Old Georgie&#x27;]}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Lilly Wachowski</td>\n",
       "        <td>DIRECTED</td>\n",
       "        <td>{}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['Tom Hanks',\n",
       "  'ACTED_IN',\n",
       "  {'roles': ['Zachry', 'Dr. Henry Goose', 'Isaac Sachs', 'Dermot Hoggins']}],\n",
       " ['Jim Broadbent',\n",
       "  'ACTED_IN',\n",
       "  {'roles': ['Vyvyan Ayrs', 'Captain Molyneux', 'Timothy Cavendish']}],\n",
       " ['David Mitchell', 'WROTE', {}],\n",
       " ['Tom Tykwer', 'DIRECTED', {}],\n",
       " ['Lana Wachowski', 'DIRECTED', {}],\n",
       " ['Stefan Arndt', 'PRODUCED', {}],\n",
       " ['Jessica Thompson',\n",
       "  'REVIEWED',\n",
       "  {'summary': 'An amazing journey', 'rating': 95}],\n",
       " ['Halle Berry',\n",
       "  'ACTED_IN',\n",
       "  {'roles': ['Luisa Rey', 'Jocasta Ayrs', 'Ovid', 'Meronym']}],\n",
       " ['Hugo Weaving',\n",
       "  'ACTED_IN',\n",
       "  {'roles': ['Bill Smoke',\n",
       "    'Haskell Moore',\n",
       "    'Tadeusz Kesselring',\n",
       "    'Nurse Noakes',\n",
       "    'Boardman Mephi',\n",
       "    'Old Georgie']}],\n",
       " ['Lilly Wachowski', 'DIRECTED', {}]]"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher  http://neo4j:engmohamed@127.0.0.1:7474/db/data\n",
    "\n",
    "MATCH (people:Person)-[relatedTo]-(:Movie {title: \"Cloud Atlas\"}) \n",
    "RETURN people.name, Type(relatedTo), relatedTo As roles_if_Actor\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    " #### Get the movies that \"Tom Hanks\" Acted in and also Directed"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>m.title</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>That Thing You Do</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['That Thing You Do']]"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher  http://neo4j:engmohamed@127.0.0.1:7474/db/data\n",
    "MATCH (tom:Person{name:\"Tom Hanks\"}) -[:ACTED_IN]->(m:Movie) <-[:DIRECTED]-(tom) \n",
    "RETURN m.title"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "###  LIMIT&&SKIP\n",
    "####  Get the movies that \"Tom Hanks\" Acted, skip the first movie and get the next following two ones.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>m.title</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>A League of Their Own</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Joe Versus the Volcano</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>That Thing You Do</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['A League of Their Own'], ['Joe Versus the Volcano'], ['That Thing You Do']]"
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher  http://neo4j:engmohamed@127.0.0.1:7474/db/data\n",
    "MATCH (:Person{name:\"Tom Hanks\"}) -[:ACTED_IN]->(m) \n",
    "RETURN m.title \n",
    "SKIP 2 \n",
    "LIMIT 3\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### ORDER BY\n",
    "#### Get the movies that \"Tom Hanks\" Acted ordered by the title"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "12 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>m.title</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>A League of Their Own</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Apollo 13</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Cast Away</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Charlie Wilson&#x27;s War</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Cloud Atlas</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Joe Versus the Volcano</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Sleepless in Seattle</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>That Thing You Do</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Da Vinci Code</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Green Mile</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Polar Express</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>You&#x27;ve Got Mail</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['A League of Their Own'],\n",
       " ['Apollo 13'],\n",
       " ['Cast Away'],\n",
       " [\"Charlie Wilson's War\"],\n",
       " ['Cloud Atlas'],\n",
       " ['Joe Versus the Volcano'],\n",
       " ['Sleepless in Seattle'],\n",
       " ['That Thing You Do'],\n",
       " ['The Da Vinci Code'],\n",
       " ['The Green Mile'],\n",
       " ['The Polar Express'],\n",
       " [\"You've Got Mail\"]]"
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher  http://neo4j:engmohamed@127.0.0.1:7474/db/data\n",
    "MATCH (:Person{name:\"Tom Hanks\"}) -[:ACTED_IN]->(m:Movie) \n",
    "RETURN m.title \n",
    "ORDER BY m.title\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Cypher Aggregation Functions\n",
    "#### Get the count of Movies acted by \"Tom Hanks\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>TomCount</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>12</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[12]]"
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher  http://neo4j:engmohamed@127.0.0.1:7474/db/data\n",
    "MATCH (:Person{name:\"Tom Hanks\"}) -[:ACTED_IN]->(m:Movie) \n",
    "RETURN COUNT(*) As TomCount"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "####  Get the top 10 profilic actors (Actors who made the most apperances in movies)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "10 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>a</th>\n",
       "        <th>appearances</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1956, &#x27;name&#x27;: &#x27;Tom Hanks&#x27;}</td>\n",
       "        <td>12</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1964, &#x27;name&#x27;: &#x27;Keanu Reeves&#x27;}</td>\n",
       "        <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1960, &#x27;name&#x27;: &#x27;Hugo Weaving&#x27;}</td>\n",
       "        <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1961, &#x27;name&#x27;: &#x27;Meg Ryan&#x27;}</td>\n",
       "        <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1937, &#x27;name&#x27;: &#x27;Jack Nicholson&#x27;}</td>\n",
       "        <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1968, &#x27;name&#x27;: &#x27;Cuba Gooding Jr.&#x27;}</td>\n",
       "        <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1961, &#x27;name&#x27;: &#x27;Laurence Fishburne&#x27;}</td>\n",
       "        <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1962, &#x27;name&#x27;: &#x27;Tom Cruise&#x27;}</td>\n",
       "        <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1963, &#x27;name&#x27;: &#x27;Helen Hunt&#x27;}</td>\n",
       "        <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1958, &#x27;name&#x27;: &#x27;Kevin Bacon&#x27;}</td>\n",
       "        <td>3</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'born': 1956, 'name': 'Tom Hanks'}, 12],\n",
       " [{'born': 1964, 'name': 'Keanu Reeves'}, 7],\n",
       " [{'born': 1960, 'name': 'Hugo Weaving'}, 5],\n",
       " [{'born': 1961, 'name': 'Meg Ryan'}, 5],\n",
       " [{'born': 1937, 'name': 'Jack Nicholson'}, 5],\n",
       " [{'born': 1968, 'name': 'Cuba Gooding Jr.'}, 4],\n",
       " [{'born': 1961, 'name': 'Laurence Fishburne'}, 3],\n",
       " [{'born': 1962, 'name': 'Tom Cruise'}, 3],\n",
       " [{'born': 1963, 'name': 'Helen Hunt'}, 3],\n",
       " [{'born': 1958, 'name': 'Kevin Bacon'}, 3]]"
      ]
     },
     "execution_count": 27,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher  http://neo4j:engmohamed@127.0.0.1:7474/db/data\n",
    "MATCH (a:Person)-[:ACTED_IN]->(m:Movie)\n",
    "RETURN a, count(*) AS appearances\n",
    "ORDER BY appearances DESC LIMIT 10"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### What is the released year of the most recent movie acted by \"Tom Hanks\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>MAX(m.released)</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>2012</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[2012]]"
      ]
     },
     "execution_count": 28,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher  http://neo4j:engmohamed@127.0.0.1:7474/db/data\n",
    "MATCH (:Person{name:\"Tom Hanks\"}) -[:ACTED_IN]->(m:Movie) \n",
    "RETURN MAX(m.released)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### For each movie, get the list of actors (cast), and their count."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "38 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>movie</th>\n",
       "        <th>cast</th>\n",
       "        <th>actors</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Matrix</td>\n",
       "        <td>[&#x27;Emil Eifrem&#x27;, &#x27;Hugo Weaving&#x27;, &#x27;Laurence Fishburne&#x27;, &#x27;Carrie-Anne Moss&#x27;, &#x27;Keanu Reeves&#x27;]</td>\n",
       "        <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Matrix Reloaded</td>\n",
       "        <td>[&#x27;Hugo Weaving&#x27;, &#x27;Laurence Fishburne&#x27;, &#x27;Carrie-Anne Moss&#x27;, &#x27;Keanu Reeves&#x27;]</td>\n",
       "        <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Matrix Revolutions</td>\n",
       "        <td>[&#x27;Hugo Weaving&#x27;, &#x27;Laurence Fishburne&#x27;, &#x27;Carrie-Anne Moss&#x27;, &#x27;Keanu Reeves&#x27;]</td>\n",
       "        <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Devil&#x27;s Advocate</td>\n",
       "        <td>[&#x27;Al Pacino&#x27;, &#x27;Charlize Theron&#x27;, &#x27;Keanu Reeves&#x27;]</td>\n",
       "        <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>A Few Good Men</td>\n",
       "        <td>[&#x27;James Marshall&#x27;, &#x27;Kevin Pollak&#x27;, &#x27;J.T. Walsh&#x27;, &#x27;Aaron Sorkin&#x27;, &#x27;Cuba Gooding Jr.&#x27;, &#x27;Christopher Guest&#x27;, &#x27;Noah Wyle&#x27;, &#x27;Kiefer Sutherland&#x27;, &#x27;Kevin Bacon&#x27;, &#x27;Demi Moore&#x27;, &#x27;Jack Nicholson&#x27;, &#x27;Tom Cruise&#x27;]</td>\n",
       "        <td>12</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Top Gun</td>\n",
       "        <td>[&#x27;Val Kilmer&#x27;, &#x27;Meg Ryan&#x27;, &#x27;Tom Skerritt&#x27;, &#x27;Kelly McGillis&#x27;, &#x27;Tom Cruise&#x27;, &#x27;Anthony Edwards&#x27;]</td>\n",
       "        <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Jerry Maguire</td>\n",
       "        <td>[&quot;Jerry O&#x27;Connell&quot;, &#x27;Bonnie Hunt&#x27;, &#x27;Jay Mohr&#x27;, &#x27;Cuba Gooding Jr.&#x27;, &#x27;Jonathan Lipnicki&#x27;, &#x27;Renee Zellweger&#x27;, &#x27;Kelly Preston&#x27;, &#x27;Regina King&#x27;, &#x27;Tom Cruise&#x27;]</td>\n",
       "        <td>9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Stand By Me</td>\n",
       "        <td>[&quot;Jerry O&#x27;Connell&quot;, &#x27;River Phoenix&#x27;, &#x27;Marshall Bell&#x27;, &#x27;Wil Wheaton&#x27;, &#x27;Kiefer Sutherland&#x27;, &#x27;John Cusack&#x27;, &#x27;Corey Feldman&#x27;]</td>\n",
       "        <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>As Good as It Gets</td>\n",
       "        <td>[&#x27;Helen Hunt&#x27;, &#x27;Jack Nicholson&#x27;, &#x27;Cuba Gooding Jr.&#x27;, &#x27;Greg Kinnear&#x27;]</td>\n",
       "        <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>What Dreams May Come</td>\n",
       "        <td>[&#x27;Robin Williams&#x27;, &#x27;Cuba Gooding Jr.&#x27;, &#x27;Max von Sydow&#x27;, &#x27;Werner Herzog&#x27;, &#x27;Annabella Sciorra&#x27;]</td>\n",
       "        <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Snow Falling on Cedars</td>\n",
       "        <td>[&#x27;Ethan Hawke&#x27;, &#x27;Rick Yune&#x27;, &#x27;Max von Sydow&#x27;, &#x27;James Cromwell&#x27;]</td>\n",
       "        <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>You&#x27;ve Got Mail</td>\n",
       "        <td>[&#x27;Tom Hanks&#x27;, &#x27;Parker Posey&#x27;, &#x27;Greg Kinnear&#x27;, &#x27;Meg Ryan&#x27;, &#x27;Steve Zahn&#x27;, &#x27;Dave Chappelle&#x27;]</td>\n",
       "        <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Sleepless in Seattle</td>\n",
       "        <td>[&#x27;Meg Ryan&#x27;, &#x27;Victor Garber&#x27;, &#x27;Tom Hanks&#x27;, &#x27;Bill Pullman&#x27;, &#x27;Rita Wilson&#x27;, &quot;Rosie O&#x27;Donnell&quot;]</td>\n",
       "        <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Joe Versus the Volcano</td>\n",
       "        <td>[&#x27;Tom Hanks&#x27;, &#x27;Nathan Lane&#x27;, &#x27;Meg Ryan&#x27;]</td>\n",
       "        <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>When Harry Met Sally</td>\n",
       "        <td>[&#x27;Carrie Fisher&#x27;, &#x27;Billy Crystal&#x27;, &#x27;Bruno Kirby&#x27;, &#x27;Meg Ryan&#x27;]</td>\n",
       "        <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>That Thing You Do</td>\n",
       "        <td>[&#x27;Tom Hanks&#x27;, &#x27;Liv Tyler&#x27;, &#x27;Charlize Theron&#x27;]</td>\n",
       "        <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Replacements</td>\n",
       "        <td>[&#x27;Brooke Langton&#x27;, &#x27;Keanu Reeves&#x27;, &#x27;Orlando Jones&#x27;, &#x27;Gene Hackman&#x27;]</td>\n",
       "        <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>RescueDawn</td>\n",
       "        <td>[&#x27;Zach Grenier&#x27;, &#x27;Steve Zahn&#x27;, &#x27;Christian Bale&#x27;, &#x27;Marshall Bell&#x27;]</td>\n",
       "        <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Birdcage</td>\n",
       "        <td>[&#x27;Robin Williams&#x27;, &#x27;Nathan Lane&#x27;, &#x27;Gene Hackman&#x27;]</td>\n",
       "        <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Unforgiven</td>\n",
       "        <td>[&#x27;Clint Eastwood&#x27;, &#x27;Gene Hackman&#x27;, &#x27;Richard Harris&#x27;]</td>\n",
       "        <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Johnny Mnemonic</td>\n",
       "        <td>[&#x27;Ice-T&#x27;, &#x27;Dina Meyer&#x27;, &#x27;Keanu Reeves&#x27;, &#x27;Takeshi Kitano&#x27;]</td>\n",
       "        <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Cloud Atlas</td>\n",
       "        <td>[&#x27;Tom Hanks&#x27;, &#x27;Jim Broadbent&#x27;, &#x27;Halle Berry&#x27;, &#x27;Hugo Weaving&#x27;]</td>\n",
       "        <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Da Vinci Code</td>\n",
       "        <td>[&#x27;Tom Hanks&#x27;, &#x27;Ian McKellen&#x27;, &#x27;Audrey Tautou&#x27;, &#x27;Paul Bettany&#x27;]</td>\n",
       "        <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>V for Vendetta</td>\n",
       "        <td>[&#x27;John Hurt&#x27;, &#x27;Stephen Rea&#x27;, &#x27;Natalie Portman&#x27;, &#x27;Hugo Weaving&#x27;, &#x27;Ben Miles&#x27;]</td>\n",
       "        <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Speed Racer</td>\n",
       "        <td>[&#x27;Emile Hirsch&#x27;, &#x27;Rain&#x27;, &#x27;Christina Ricci&#x27;, &#x27;Ben Miles&#x27;, &#x27;Susan Sarandon&#x27;, &#x27;John Goodman&#x27;, &#x27;Matthew Fox&#x27;]</td>\n",
       "        <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Ninja Assassin</td>\n",
       "        <td>[&#x27;Rain&#x27;, &#x27;Ben Miles&#x27;, &#x27;Rick Yune&#x27;, &#x27;Naomie Harris&#x27;]</td>\n",
       "        <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Green Mile</td>\n",
       "        <td>[&#x27;Sam Rockwell&#x27;, &#x27;Bonnie Hunt&#x27;, &#x27;Patricia Clarkson&#x27;, &#x27;James Cromwell&#x27;, &#x27;Tom Hanks&#x27;, &#x27;Michael Clarke Duncan&#x27;, &#x27;David Morse&#x27;, &#x27;Gary Sinise&#x27;]</td>\n",
       "        <td>8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Frost/Nixon</td>\n",
       "        <td>[&#x27;Sam Rockwell&#x27;, &#x27;Michael Sheen&#x27;, &#x27;Frank Langella&#x27;, &#x27;Oliver Platt&#x27;, &#x27;Kevin Bacon&#x27;]</td>\n",
       "        <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Hoffa</td>\n",
       "        <td>[&#x27;John C. Reilly&#x27;, &#x27;Danny DeVito&#x27;, &#x27;J.T. Walsh&#x27;, &#x27;Jack Nicholson&#x27;]</td>\n",
       "        <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Apollo 13</td>\n",
       "        <td>[&#x27;Tom Hanks&#x27;, &#x27;Ed Harris&#x27;, &#x27;Gary Sinise&#x27;, &#x27;Kevin Bacon&#x27;, &#x27;Bill Paxton&#x27;]</td>\n",
       "        <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Twister</td>\n",
       "        <td>[&#x27;Helen Hunt&#x27;, &#x27;Bill Paxton&#x27;, &#x27;Philip Seymour Hoffman&#x27;, &#x27;Zach Grenier&#x27;]</td>\n",
       "        <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Cast Away</td>\n",
       "        <td>[&#x27;Helen Hunt&#x27;, &#x27;Tom Hanks&#x27;]</td>\n",
       "        <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>One Flew Over the Cuckoo&#x27;s Nest</td>\n",
       "        <td>[&#x27;Danny DeVito&#x27;, &#x27;Jack Nicholson&#x27;]</td>\n",
       "        <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Something&#x27;s Gotta Give</td>\n",
       "        <td>[&#x27;Keanu Reeves&#x27;, &#x27;Diane Keaton&#x27;, &#x27;Jack Nicholson&#x27;]</td>\n",
       "        <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Bicentennial Man</td>\n",
       "        <td>[&#x27;Robin Williams&#x27;, &#x27;Oliver Platt&#x27;]</td>\n",
       "        <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Charlie Wilson&#x27;s War</td>\n",
       "        <td>[&#x27;Julia Roberts&#x27;, &#x27;Tom Hanks&#x27;, &#x27;Philip Seymour Hoffman&#x27;]</td>\n",
       "        <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Polar Express</td>\n",
       "        <td>[&#x27;Tom Hanks&#x27;]</td>\n",
       "        <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>A League of Their Own</td>\n",
       "        <td>[&#x27;Tom Hanks&#x27;, &#x27;Madonna&#x27;, &quot;Rosie O&#x27;Donnell&quot;, &#x27;Geena Davis&#x27;, &#x27;Bill Paxton&#x27;, &#x27;Lori Petty&#x27;]</td>\n",
       "        <td>6</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['The Matrix',\n",
       "  ['Emil Eifrem',\n",
       "   'Hugo Weaving',\n",
       "   'Laurence Fishburne',\n",
       "   'Carrie-Anne Moss',\n",
       "   'Keanu Reeves'],\n",
       "  5],\n",
       " ['The Matrix Reloaded',\n",
       "  ['Hugo Weaving', 'Laurence Fishburne', 'Carrie-Anne Moss', 'Keanu Reeves'],\n",
       "  4],\n",
       " ['The Matrix Revolutions',\n",
       "  ['Hugo Weaving', 'Laurence Fishburne', 'Carrie-Anne Moss', 'Keanu Reeves'],\n",
       "  4],\n",
       " [\"The Devil's Advocate\", ['Al Pacino', 'Charlize Theron', 'Keanu Reeves'], 3],\n",
       " ['A Few Good Men',\n",
       "  ['James Marshall',\n",
       "   'Kevin Pollak',\n",
       "   'J.T. Walsh',\n",
       "   'Aaron Sorkin',\n",
       "   'Cuba Gooding Jr.',\n",
       "   'Christopher Guest',\n",
       "   'Noah Wyle',\n",
       "   'Kiefer Sutherland',\n",
       "   'Kevin Bacon',\n",
       "   'Demi Moore',\n",
       "   'Jack Nicholson',\n",
       "   'Tom Cruise'],\n",
       "  12],\n",
       " ['Top Gun',\n",
       "  ['Val Kilmer',\n",
       "   'Meg Ryan',\n",
       "   'Tom Skerritt',\n",
       "   'Kelly McGillis',\n",
       "   'Tom Cruise',\n",
       "   'Anthony Edwards'],\n",
       "  6],\n",
       " ['Jerry Maguire',\n",
       "  [\"Jerry O'Connell\",\n",
       "   'Bonnie Hunt',\n",
       "   'Jay Mohr',\n",
       "   'Cuba Gooding Jr.',\n",
       "   'Jonathan Lipnicki',\n",
       "   'Renee Zellweger',\n",
       "   'Kelly Preston',\n",
       "   'Regina King',\n",
       "   'Tom Cruise'],\n",
       "  9],\n",
       " ['Stand By Me',\n",
       "  [\"Jerry O'Connell\",\n",
       "   'River Phoenix',\n",
       "   'Marshall Bell',\n",
       "   'Wil Wheaton',\n",
       "   'Kiefer Sutherland',\n",
       "   'John Cusack',\n",
       "   'Corey Feldman'],\n",
       "  7],\n",
       " ['As Good as It Gets',\n",
       "  ['Helen Hunt', 'Jack Nicholson', 'Cuba Gooding Jr.', 'Greg Kinnear'],\n",
       "  4],\n",
       " ['What Dreams May Come',\n",
       "  ['Robin Williams',\n",
       "   'Cuba Gooding Jr.',\n",
       "   'Max von Sydow',\n",
       "   'Werner Herzog',\n",
       "   'Annabella Sciorra'],\n",
       "  5],\n",
       " ['Snow Falling on Cedars',\n",
       "  ['Ethan Hawke', 'Rick Yune', 'Max von Sydow', 'James Cromwell'],\n",
       "  4],\n",
       " [\"You've Got Mail\",\n",
       "  ['Tom Hanks',\n",
       "   'Parker Posey',\n",
       "   'Greg Kinnear',\n",
       "   'Meg Ryan',\n",
       "   'Steve Zahn',\n",
       "   'Dave Chappelle'],\n",
       "  6],\n",
       " ['Sleepless in Seattle',\n",
       "  ['Meg Ryan',\n",
       "   'Victor Garber',\n",
       "   'Tom Hanks',\n",
       "   'Bill Pullman',\n",
       "   'Rita Wilson',\n",
       "   \"Rosie O'Donnell\"],\n",
       "  6],\n",
       " ['Joe Versus the Volcano', ['Tom Hanks', 'Nathan Lane', 'Meg Ryan'], 3],\n",
       " ['When Harry Met Sally',\n",
       "  ['Carrie Fisher', 'Billy Crystal', 'Bruno Kirby', 'Meg Ryan'],\n",
       "  4],\n",
       " ['That Thing You Do', ['Tom Hanks', 'Liv Tyler', 'Charlize Theron'], 3],\n",
       " ['The Replacements',\n",
       "  ['Brooke Langton', 'Keanu Reeves', 'Orlando Jones', 'Gene Hackman'],\n",
       "  4],\n",
       " ['RescueDawn',\n",
       "  ['Zach Grenier', 'Steve Zahn', 'Christian Bale', 'Marshall Bell'],\n",
       "  4],\n",
       " ['The Birdcage', ['Robin Williams', 'Nathan Lane', 'Gene Hackman'], 3],\n",
       " ['Unforgiven', ['Clint Eastwood', 'Gene Hackman', 'Richard Harris'], 3],\n",
       " ['Johnny Mnemonic',\n",
       "  ['Ice-T', 'Dina Meyer', 'Keanu Reeves', 'Takeshi Kitano'],\n",
       "  4],\n",
       " ['Cloud Atlas',\n",
       "  ['Tom Hanks', 'Jim Broadbent', 'Halle Berry', 'Hugo Weaving'],\n",
       "  4],\n",
       " ['The Da Vinci Code',\n",
       "  ['Tom Hanks', 'Ian McKellen', 'Audrey Tautou', 'Paul Bettany'],\n",
       "  4],\n",
       " ['V for Vendetta',\n",
       "  ['John Hurt', 'Stephen Rea', 'Natalie Portman', 'Hugo Weaving', 'Ben Miles'],\n",
       "  5],\n",
       " ['Speed Racer',\n",
       "  ['Emile Hirsch',\n",
       "   'Rain',\n",
       "   'Christina Ricci',\n",
       "   'Ben Miles',\n",
       "   'Susan Sarandon',\n",
       "   'John Goodman',\n",
       "   'Matthew Fox'],\n",
       "  7],\n",
       " ['Ninja Assassin', ['Rain', 'Ben Miles', 'Rick Yune', 'Naomie Harris'], 4],\n",
       " ['The Green Mile',\n",
       "  ['Sam Rockwell',\n",
       "   'Bonnie Hunt',\n",
       "   'Patricia Clarkson',\n",
       "   'James Cromwell',\n",
       "   'Tom Hanks',\n",
       "   'Michael Clarke Duncan',\n",
       "   'David Morse',\n",
       "   'Gary Sinise'],\n",
       "  8],\n",
       " ['Frost/Nixon',\n",
       "  ['Sam Rockwell',\n",
       "   'Michael Sheen',\n",
       "   'Frank Langella',\n",
       "   'Oliver Platt',\n",
       "   'Kevin Bacon'],\n",
       "  5],\n",
       " ['Hoffa',\n",
       "  ['John C. Reilly', 'Danny DeVito', 'J.T. Walsh', 'Jack Nicholson'],\n",
       "  4],\n",
       " ['Apollo 13',\n",
       "  ['Tom Hanks', 'Ed Harris', 'Gary Sinise', 'Kevin Bacon', 'Bill Paxton'],\n",
       "  5],\n",
       " ['Twister',\n",
       "  ['Helen Hunt', 'Bill Paxton', 'Philip Seymour Hoffman', 'Zach Grenier'],\n",
       "  4],\n",
       " ['Cast Away', ['Helen Hunt', 'Tom Hanks'], 2],\n",
       " [\"One Flew Over the Cuckoo's Nest\", ['Danny DeVito', 'Jack Nicholson'], 2],\n",
       " [\"Something's Gotta Give\",\n",
       "  ['Keanu Reeves', 'Diane Keaton', 'Jack Nicholson'],\n",
       "  3],\n",
       " ['Bicentennial Man', ['Robin Williams', 'Oliver Platt'], 2],\n",
       " [\"Charlie Wilson's War\",\n",
       "  ['Julia Roberts', 'Tom Hanks', 'Philip Seymour Hoffman'],\n",
       "  3],\n",
       " ['The Polar Express', ['Tom Hanks'], 1],\n",
       " ['A League of Their Own',\n",
       "  ['Tom Hanks',\n",
       "   'Madonna',\n",
       "   \"Rosie O'Donnell\",\n",
       "   'Geena Davis',\n",
       "   'Bill Paxton',\n",
       "   'Lori Petty'],\n",
       "  6]]"
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:engmohamed@127.0.0.1:7474/db/data\n",
    "MATCH (m:Movie)<-[:ACTED_IN]-(a:Person)\n",
    "RETURN m.title AS movie, collect(a.name) AS cast, count(*) AS actors"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Get the first 3 movies of each actor"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "102 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>n.name</th>\n",
       "        <th>movies</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Keanu Reeves</td>\n",
       "        <td>[&quot;Something&#x27;s Gotta Give&quot;, &#x27;The Replacements&#x27;, &#x27;Johnny Mnemonic&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Carrie-Anne Moss</td>\n",
       "        <td>[&#x27;The Matrix Revolutions&#x27;, &#x27;The Matrix Reloaded&#x27;, &#x27;The Matrix&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Laurence Fishburne</td>\n",
       "        <td>[&#x27;The Matrix Revolutions&#x27;, &#x27;The Matrix Reloaded&#x27;, &#x27;The Matrix&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Hugo Weaving</td>\n",
       "        <td>[&#x27;Cloud Atlas&#x27;, &#x27;V for Vendetta&#x27;, &#x27;The Matrix Revolutions&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Emil Eifrem</td>\n",
       "        <td>[&#x27;The Matrix&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Charlize Theron</td>\n",
       "        <td>[&#x27;That Thing You Do&#x27;, &quot;The Devil&#x27;s Advocate&quot;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Al Pacino</td>\n",
       "        <td>[&quot;The Devil&#x27;s Advocate&quot;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Tom Cruise</td>\n",
       "        <td>[&#x27;Jerry Maguire&#x27;, &#x27;Top Gun&#x27;, &#x27;A Few Good Men&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Jack Nicholson</td>\n",
       "        <td>[&#x27;As Good as It Gets&#x27;, &quot;One Flew Over the Cuckoo&#x27;s Nest&quot;, &quot;Something&#x27;s Gotta Give&quot;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Demi Moore</td>\n",
       "        <td>[&#x27;A Few Good Men&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Kevin Bacon</td>\n",
       "        <td>[&#x27;Apollo 13&#x27;, &#x27;Frost/Nixon&#x27;, &#x27;A Few Good Men&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Kiefer Sutherland</td>\n",
       "        <td>[&#x27;Stand By Me&#x27;, &#x27;A Few Good Men&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Noah Wyle</td>\n",
       "        <td>[&#x27;A Few Good Men&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Cuba Gooding Jr.</td>\n",
       "        <td>[&#x27;What Dreams May Come&#x27;, &#x27;Jerry Maguire&#x27;, &#x27;As Good as It Gets&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Kevin Pollak</td>\n",
       "        <td>[&#x27;A Few Good Men&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>J.T. Walsh</td>\n",
       "        <td>[&#x27;Hoffa&#x27;, &#x27;A Few Good Men&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>James Marshall</td>\n",
       "        <td>[&#x27;A Few Good Men&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Christopher Guest</td>\n",
       "        <td>[&#x27;A Few Good Men&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Aaron Sorkin</td>\n",
       "        <td>[&#x27;A Few Good Men&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Kelly McGillis</td>\n",
       "        <td>[&#x27;Top Gun&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Val Kilmer</td>\n",
       "        <td>[&#x27;Top Gun&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Anthony Edwards</td>\n",
       "        <td>[&#x27;Top Gun&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Tom Skerritt</td>\n",
       "        <td>[&#x27;Top Gun&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Meg Ryan</td>\n",
       "        <td>[&#x27;Sleepless in Seattle&#x27;, &quot;You&#x27;ve Got Mail&quot;, &#x27;Top Gun&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Renee Zellweger</td>\n",
       "        <td>[&#x27;Jerry Maguire&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Kelly Preston</td>\n",
       "        <td>[&#x27;Jerry Maguire&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Jerry O&#x27;Connell</td>\n",
       "        <td>[&#x27;Jerry Maguire&#x27;, &#x27;Stand By Me&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Jay Mohr</td>\n",
       "        <td>[&#x27;Jerry Maguire&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Bonnie Hunt</td>\n",
       "        <td>[&#x27;The Green Mile&#x27;, &#x27;Jerry Maguire&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Regina King</td>\n",
       "        <td>[&#x27;Jerry Maguire&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Jonathan Lipnicki</td>\n",
       "        <td>[&#x27;Jerry Maguire&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>River Phoenix</td>\n",
       "        <td>[&#x27;Stand By Me&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Corey Feldman</td>\n",
       "        <td>[&#x27;Stand By Me&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Wil Wheaton</td>\n",
       "        <td>[&#x27;Stand By Me&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>John Cusack</td>\n",
       "        <td>[&#x27;Stand By Me&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Marshall Bell</td>\n",
       "        <td>[&#x27;Stand By Me&#x27;, &#x27;RescueDawn&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Helen Hunt</td>\n",
       "        <td>[&#x27;As Good as It Gets&#x27;, &#x27;Cast Away&#x27;, &#x27;Twister&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Greg Kinnear</td>\n",
       "        <td>[&quot;You&#x27;ve Got Mail&quot;, &#x27;As Good as It Gets&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Annabella Sciorra</td>\n",
       "        <td>[&#x27;What Dreams May Come&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Max von Sydow</td>\n",
       "        <td>[&#x27;What Dreams May Come&#x27;, &#x27;Snow Falling on Cedars&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Werner Herzog</td>\n",
       "        <td>[&#x27;What Dreams May Come&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Robin Williams</td>\n",
       "        <td>[&#x27;What Dreams May Come&#x27;, &#x27;Bicentennial Man&#x27;, &#x27;The Birdcage&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Ethan Hawke</td>\n",
       "        <td>[&#x27;Snow Falling on Cedars&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Rick Yune</td>\n",
       "        <td>[&#x27;Ninja Assassin&#x27;, &#x27;Snow Falling on Cedars&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>James Cromwell</td>\n",
       "        <td>[&#x27;The Green Mile&#x27;, &#x27;Snow Falling on Cedars&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Parker Posey</td>\n",
       "        <td>[&quot;You&#x27;ve Got Mail&quot;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Dave Chappelle</td>\n",
       "        <td>[&quot;You&#x27;ve Got Mail&quot;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Steve Zahn</td>\n",
       "        <td>[&#x27;RescueDawn&#x27;, &quot;You&#x27;ve Got Mail&quot;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Tom Hanks</td>\n",
       "        <td>[&#x27;Apollo 13&#x27;, &quot;You&#x27;ve Got Mail&quot;, &#x27;A League of Their Own&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Rita Wilson</td>\n",
       "        <td>[&#x27;Sleepless in Seattle&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Bill Pullman</td>\n",
       "        <td>[&#x27;Sleepless in Seattle&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Victor Garber</td>\n",
       "        <td>[&#x27;Sleepless in Seattle&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Rosie O&#x27;Donnell</td>\n",
       "        <td>[&#x27;A League of Their Own&#x27;, &#x27;Sleepless in Seattle&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Nathan Lane</td>\n",
       "        <td>[&#x27;Joe Versus the Volcano&#x27;, &#x27;The Birdcage&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Billy Crystal</td>\n",
       "        <td>[&#x27;When Harry Met Sally&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Carrie Fisher</td>\n",
       "        <td>[&#x27;When Harry Met Sally&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Bruno Kirby</td>\n",
       "        <td>[&#x27;When Harry Met Sally&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Liv Tyler</td>\n",
       "        <td>[&#x27;That Thing You Do&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Brooke Langton</td>\n",
       "        <td>[&#x27;The Replacements&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Gene Hackman</td>\n",
       "        <td>[&#x27;Unforgiven&#x27;, &#x27;The Birdcage&#x27;, &#x27;The Replacements&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Orlando Jones</td>\n",
       "        <td>[&#x27;The Replacements&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Christian Bale</td>\n",
       "        <td>[&#x27;RescueDawn&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Zach Grenier</td>\n",
       "        <td>[&#x27;RescueDawn&#x27;, &#x27;Twister&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Richard Harris</td>\n",
       "        <td>[&#x27;Unforgiven&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Clint Eastwood</td>\n",
       "        <td>[&#x27;Unforgiven&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Takeshi Kitano</td>\n",
       "        <td>[&#x27;Johnny Mnemonic&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Dina Meyer</td>\n",
       "        <td>[&#x27;Johnny Mnemonic&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Ice-T</td>\n",
       "        <td>[&#x27;Johnny Mnemonic&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Halle Berry</td>\n",
       "        <td>[&#x27;Cloud Atlas&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Jim Broadbent</td>\n",
       "        <td>[&#x27;Cloud Atlas&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Ian McKellen</td>\n",
       "        <td>[&#x27;The Da Vinci Code&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Audrey Tautou</td>\n",
       "        <td>[&#x27;The Da Vinci Code&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Paul Bettany</td>\n",
       "        <td>[&#x27;The Da Vinci Code&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Natalie Portman</td>\n",
       "        <td>[&#x27;V for Vendetta&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Stephen Rea</td>\n",
       "        <td>[&#x27;V for Vendetta&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>John Hurt</td>\n",
       "        <td>[&#x27;V for Vendetta&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Ben Miles</td>\n",
       "        <td>[&#x27;Speed Racer&#x27;, &#x27;Ninja Assassin&#x27;, &#x27;V for Vendetta&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Emile Hirsch</td>\n",
       "        <td>[&#x27;Speed Racer&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>John Goodman</td>\n",
       "        <td>[&#x27;Speed Racer&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Susan Sarandon</td>\n",
       "        <td>[&#x27;Speed Racer&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Matthew Fox</td>\n",
       "        <td>[&#x27;Speed Racer&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Christina Ricci</td>\n",
       "        <td>[&#x27;Speed Racer&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Rain</td>\n",
       "        <td>[&#x27;Speed Racer&#x27;, &#x27;Ninja Assassin&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Naomie Harris</td>\n",
       "        <td>[&#x27;Ninja Assassin&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Michael Clarke Duncan</td>\n",
       "        <td>[&#x27;The Green Mile&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>David Morse</td>\n",
       "        <td>[&#x27;The Green Mile&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Sam Rockwell</td>\n",
       "        <td>[&#x27;The Green Mile&#x27;, &#x27;Frost/Nixon&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Gary Sinise</td>\n",
       "        <td>[&#x27;Apollo 13&#x27;, &#x27;The Green Mile&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Patricia Clarkson</td>\n",
       "        <td>[&#x27;The Green Mile&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Frank Langella</td>\n",
       "        <td>[&#x27;Frost/Nixon&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Michael Sheen</td>\n",
       "        <td>[&#x27;Frost/Nixon&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Oliver Platt</td>\n",
       "        <td>[&#x27;Frost/Nixon&#x27;, &#x27;Bicentennial Man&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Danny DeVito</td>\n",
       "        <td>[&#x27;Hoffa&#x27;, &quot;One Flew Over the Cuckoo&#x27;s Nest&quot;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>John C. Reilly</td>\n",
       "        <td>[&#x27;Hoffa&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Ed Harris</td>\n",
       "        <td>[&#x27;Apollo 13&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Bill Paxton</td>\n",
       "        <td>[&#x27;Twister&#x27;, &#x27;A League of Their Own&#x27;, &#x27;Apollo 13&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Philip Seymour Hoffman</td>\n",
       "        <td>[&#x27;Twister&#x27;, &quot;Charlie Wilson&#x27;s War&quot;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Diane Keaton</td>\n",
       "        <td>[&quot;Something&#x27;s Gotta Give&quot;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Julia Roberts</td>\n",
       "        <td>[&quot;Charlie Wilson&#x27;s War&quot;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Madonna</td>\n",
       "        <td>[&#x27;A League of Their Own&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Geena Davis</td>\n",
       "        <td>[&#x27;A League of Their Own&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Lori Petty</td>\n",
       "        <td>[&#x27;A League of Their Own&#x27;]</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['Keanu Reeves',\n",
       "  [\"Something's Gotta Give\", 'The Replacements', 'Johnny Mnemonic']],\n",
       " ['Carrie-Anne Moss',\n",
       "  ['The Matrix Revolutions', 'The Matrix Reloaded', 'The Matrix']],\n",
       " ['Laurence Fishburne',\n",
       "  ['The Matrix Revolutions', 'The Matrix Reloaded', 'The Matrix']],\n",
       " ['Hugo Weaving', ['Cloud Atlas', 'V for Vendetta', 'The Matrix Revolutions']],\n",
       " ['Emil Eifrem', ['The Matrix']],\n",
       " ['Charlize Theron', ['That Thing You Do', \"The Devil's Advocate\"]],\n",
       " ['Al Pacino', [\"The Devil's Advocate\"]],\n",
       " ['Tom Cruise', ['Jerry Maguire', 'Top Gun', 'A Few Good Men']],\n",
       " ['Jack Nicholson',\n",
       "  ['As Good as It Gets',\n",
       "   \"One Flew Over the Cuckoo's Nest\",\n",
       "   \"Something's Gotta Give\"]],\n",
       " ['Demi Moore', ['A Few Good Men']],\n",
       " ['Kevin Bacon', ['Apollo 13', 'Frost/Nixon', 'A Few Good Men']],\n",
       " ['Kiefer Sutherland', ['Stand By Me', 'A Few Good Men']],\n",
       " ['Noah Wyle', ['A Few Good Men']],\n",
       " ['Cuba Gooding Jr.',\n",
       "  ['What Dreams May Come', 'Jerry Maguire', 'As Good as It Gets']],\n",
       " ['Kevin Pollak', ['A Few Good Men']],\n",
       " ['J.T. Walsh', ['Hoffa', 'A Few Good Men']],\n",
       " ['James Marshall', ['A Few Good Men']],\n",
       " ['Christopher Guest', ['A Few Good Men']],\n",
       " ['Aaron Sorkin', ['A Few Good Men']],\n",
       " ['Kelly McGillis', ['Top Gun']],\n",
       " ['Val Kilmer', ['Top Gun']],\n",
       " ['Anthony Edwards', ['Top Gun']],\n",
       " ['Tom Skerritt', ['Top Gun']],\n",
       " ['Meg Ryan', ['Sleepless in Seattle', \"You've Got Mail\", 'Top Gun']],\n",
       " ['Renee Zellweger', ['Jerry Maguire']],\n",
       " ['Kelly Preston', ['Jerry Maguire']],\n",
       " [\"Jerry O'Connell\", ['Jerry Maguire', 'Stand By Me']],\n",
       " ['Jay Mohr', ['Jerry Maguire']],\n",
       " ['Bonnie Hunt', ['The Green Mile', 'Jerry Maguire']],\n",
       " ['Regina King', ['Jerry Maguire']],\n",
       " ['Jonathan Lipnicki', ['Jerry Maguire']],\n",
       " ['River Phoenix', ['Stand By Me']],\n",
       " ['Corey Feldman', ['Stand By Me']],\n",
       " ['Wil Wheaton', ['Stand By Me']],\n",
       " ['John Cusack', ['Stand By Me']],\n",
       " ['Marshall Bell', ['Stand By Me', 'RescueDawn']],\n",
       " ['Helen Hunt', ['As Good as It Gets', 'Cast Away', 'Twister']],\n",
       " ['Greg Kinnear', [\"You've Got Mail\", 'As Good as It Gets']],\n",
       " ['Annabella Sciorra', ['What Dreams May Come']],\n",
       " ['Max von Sydow', ['What Dreams May Come', 'Snow Falling on Cedars']],\n",
       " ['Werner Herzog', ['What Dreams May Come']],\n",
       " ['Robin Williams',\n",
       "  ['What Dreams May Come', 'Bicentennial Man', 'The Birdcage']],\n",
       " ['Ethan Hawke', ['Snow Falling on Cedars']],\n",
       " ['Rick Yune', ['Ninja Assassin', 'Snow Falling on Cedars']],\n",
       " ['James Cromwell', ['The Green Mile', 'Snow Falling on Cedars']],\n",
       " ['Parker Posey', [\"You've Got Mail\"]],\n",
       " ['Dave Chappelle', [\"You've Got Mail\"]],\n",
       " ['Steve Zahn', ['RescueDawn', \"You've Got Mail\"]],\n",
       " ['Tom Hanks', ['Apollo 13', \"You've Got Mail\", 'A League of Their Own']],\n",
       " ['Rita Wilson', ['Sleepless in Seattle']],\n",
       " ['Bill Pullman', ['Sleepless in Seattle']],\n",
       " ['Victor Garber', ['Sleepless in Seattle']],\n",
       " [\"Rosie O'Donnell\", ['A League of Their Own', 'Sleepless in Seattle']],\n",
       " ['Nathan Lane', ['Joe Versus the Volcano', 'The Birdcage']],\n",
       " ['Billy Crystal', ['When Harry Met Sally']],\n",
       " ['Carrie Fisher', ['When Harry Met Sally']],\n",
       " ['Bruno Kirby', ['When Harry Met Sally']],\n",
       " ['Liv Tyler', ['That Thing You Do']],\n",
       " ['Brooke Langton', ['The Replacements']],\n",
       " ['Gene Hackman', ['Unforgiven', 'The Birdcage', 'The Replacements']],\n",
       " ['Orlando Jones', ['The Replacements']],\n",
       " ['Christian Bale', ['RescueDawn']],\n",
       " ['Zach Grenier', ['RescueDawn', 'Twister']],\n",
       " ['Richard Harris', ['Unforgiven']],\n",
       " ['Clint Eastwood', ['Unforgiven']],\n",
       " ['Takeshi Kitano', ['Johnny Mnemonic']],\n",
       " ['Dina Meyer', ['Johnny Mnemonic']],\n",
       " ['Ice-T', ['Johnny Mnemonic']],\n",
       " ['Halle Berry', ['Cloud Atlas']],\n",
       " ['Jim Broadbent', ['Cloud Atlas']],\n",
       " ['Ian McKellen', ['The Da Vinci Code']],\n",
       " ['Audrey Tautou', ['The Da Vinci Code']],\n",
       " ['Paul Bettany', ['The Da Vinci Code']],\n",
       " ['Natalie Portman', ['V for Vendetta']],\n",
       " ['Stephen Rea', ['V for Vendetta']],\n",
       " ['John Hurt', ['V for Vendetta']],\n",
       " ['Ben Miles', ['Speed Racer', 'Ninja Assassin', 'V for Vendetta']],\n",
       " ['Emile Hirsch', ['Speed Racer']],\n",
       " ['John Goodman', ['Speed Racer']],\n",
       " ['Susan Sarandon', ['Speed Racer']],\n",
       " ['Matthew Fox', ['Speed Racer']],\n",
       " ['Christina Ricci', ['Speed Racer']],\n",
       " ['Rain', ['Speed Racer', 'Ninja Assassin']],\n",
       " ['Naomie Harris', ['Ninja Assassin']],\n",
       " ['Michael Clarke Duncan', ['The Green Mile']],\n",
       " ['David Morse', ['The Green Mile']],\n",
       " ['Sam Rockwell', ['The Green Mile', 'Frost/Nixon']],\n",
       " ['Gary Sinise', ['Apollo 13', 'The Green Mile']],\n",
       " ['Patricia Clarkson', ['The Green Mile']],\n",
       " ['Frank Langella', ['Frost/Nixon']],\n",
       " ['Michael Sheen', ['Frost/Nixon']],\n",
       " ['Oliver Platt', ['Frost/Nixon', 'Bicentennial Man']],\n",
       " ['Danny DeVito', ['Hoffa', \"One Flew Over the Cuckoo's Nest\"]],\n",
       " ['John C. Reilly', ['Hoffa']],\n",
       " ['Ed Harris', ['Apollo 13']],\n",
       " ['Bill Paxton', ['Twister', 'A League of Their Own', 'Apollo 13']],\n",
       " ['Philip Seymour Hoffman', ['Twister', \"Charlie Wilson's War\"]],\n",
       " ['Diane Keaton', [\"Something's Gotta Give\"]],\n",
       " ['Julia Roberts', [\"Charlie Wilson's War\"]],\n",
       " ['Madonna', ['A League of Their Own']],\n",
       " ['Geena Davis', ['A League of Their Own']],\n",
       " ['Lori Petty', ['A League of Their Own']]]"
      ]
     },
     "execution_count": 30,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher  http://neo4j:engmohamed@127.0.0.1:7474/db/data\n",
    "MATCH (n:Person)-[:ACTED_IN]-(m)\n",
    "Return n.name , \n",
    "collect(m.title)[..3] as movies"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### WITH Clause\n",
    "#### Get the First 3 People in the DB ordered descending by the name into a list"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>collect(n.name)</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Zach Grenier&#x27;, &#x27;Wil Wheaton&#x27;, &#x27;Werner Herzog&#x27;]</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[['Zach Grenier', 'Wil Wheaton', 'Werner Herzog']]]"
      ]
     },
     "execution_count": 31,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher  http://neo4j:engmohamed@127.0.0.1:7474/db/data\n",
    "MATCH (n:Person) \n",
    "WITH n \n",
    "ORDER BY n.name DESC \n",
    "LIMIT 3 \n",
    "RETURN collect(n.name)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Get the title of the most recent movie acted by Tom Hanks"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>m.title</th>\n",
       "        <th>m.released</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Cloud Atlas</td>\n",
       "        <td>2012</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['Cloud Atlas', 2012]]"
      ]
     },
     "execution_count": 34,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher  http://neo4j:engmohamed@127.0.0.1:7474/db/data\n",
    "MATCH (p:Person{name:\"Tom Hanks\"})-[:ACTED_IN]->(m:Movie) \n",
    "WITH MAX(m.released) AS max \n",
    "MATCH (m:Movie{released:max}) \n",
    "RETURN m.title,m.released"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# THANK YOU, and GOOD LUCK!"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
